{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "import textwrap\n",
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings\n",
    "from langchain.chains import RetrievalQAWithSourcesChain\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain.prompts.prompt import PromptTemplate\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "\n",
    "OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')\n",
    "\n",
    "# Global constants\n",
    "VECTOR_INDEX_NAME = 'form_10k_chunks'\n",
    "VECTOR_NODE_LABEL = 'Chunk'\n",
    "VECTOR_SOURCE_PROPERTY = 'text'\n",
    "VECTOR_EMBEDDING_PROPERTY = 'textEmbedding'\n",
    "\n",
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'cusip6': '64110D', 'companyName': 'NETAPP INC'}\n"
     ]
    }
   ],
   "source": [
    "company_rows = kg.query(\"\"\"\n",
    "  MATCH (com:Company)\n",
    "  RETURN com { .cusip6, .companyName } as company\n",
    "\"\"\")\n",
    "\n",
    "companies = list(map(lambda row: row['company'], company_rows))\n",
    "\n",
    "print(companies[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'cusip6': '001055',\n",
       " 'cik': '4977',\n",
       " 'names': \"{'AFLAC INC'}\",\n",
       " 'cusip': \"{'001055902', '000105510', '001055102', '001055952'}\"}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import csv\n",
    "\n",
    "cik_mappings= []\n",
    "\n",
    "with open('./data/cusip6-to-cik-mapping.csv', mode='r') as csv_file:\n",
    "    csv_reader = csv.DictReader(csv_file)\n",
    "    for row in csv_reader: # each row will be a dictionary\n",
    "      cik_mappings.append(row)\n",
    "\n",
    "first_cik_mapping = cik_mappings[0]\n",
    "\n",
    "first_cik_mapping"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'cusip6': '64110D',\n",
       " 'cik': '1002047',\n",
       " 'names': \"{'Netapp Inc', 'NETAPP INC'}\",\n",
       " 'cusip': \"{'64110D954', '64110D904', '64110D104', '64110d104'}\"}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def find(lst, key, value):\n",
    "    for i, dic in enumerate(lst):\n",
    "        if dic[key] == value:\n",
    "            return i\n",
    "    return -1\n",
    "\n",
    "mapping_idx = find(cik_mappings, 'cusip6', '64110D')\n",
    "\n",
    "cik_mappings[mapping_idx]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'cusip6': '64110D', 'companyName': 'NETAPP INC', 'cik': '1002047'}\n"
     ]
    }
   ],
   "source": [
    "for company in companies:\n",
    "    mapping_idx = find(cik_mappings, 'cusip6', company['cusip6'])\n",
    "    if mapping_idx != -1:\n",
    "        company['cik'] = cik_mappings[mapping_idx]['cik']\n",
    "    else:\n",
    "        company['cik'] = None\n",
    "\n",
    "print(companies[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "set_company_cik_cypher = \"\"\"\n",
    "  MATCH (com:Company {cusip6: $cusip6})\n",
    "  SET com.cik = $cik\n",
    "\"\"\"\n",
    "\n",
    "for company in companies:\n",
    "    if company['cik']:\n",
    "        kg.query(set_company_cik_cypher, params={\n",
    "            \"cusip6\": company['cusip6'],\n",
    "            \"cik\": company['cik']\n",
    "        })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://data.sec.gov/api/xbrl/companyfacts/CIK0001002047.json\n",
      "Entity Name: NetApp, Inc.\n",
      "CIK: 1002047\n",
      "dei\n",
      "us-gaap\n",
      "EntityCommonStockSharesOutstanding\n",
      "EntityPublicFloat\n",
      "AcceleratedShareRepurchasesFinalPricePaidPerShare\n",
      "AcceleratedShareRepurchasesSettlementPaymentOrReceipt\n",
      "AccountsPayableCurrent\n",
      "AccountsReceivableNetCurrent\n",
      "AccruedIncomeTaxesNoncurrent\n",
      "AccruedLiabilitiesCurrent\n",
      "AccumulatedDepreciationDepletionAndAmortizationPropertyPlantAndEquipment\n",
      "AccumulatedOtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentNetOfTax\n",
      "AccumulatedOtherComprehensiveIncomeLossCumulativeChangesInNetGainLossFromCashFlowHedgesEffectNetOfTax\n",
      "AccumulatedOtherComprehensiveIncomeLossDefinedBenefitPensionAndOtherPostretirementPlansNetOfTax\n",
      "AccumulatedOtherComprehensiveIncomeLossForeignCurrencyTranslationAdjustmentNetOfTax\n",
      "AccumulatedOtherComprehensiveIncomeLossNetOfTax\n",
      "AcquiredFiniteLivedIntangibleAssetAmount\n",
      "AdditionalPaidInCapitalCommonStock\n",
      "AdjustmentForAmortization\n",
      "AdjustmentsNoncashItemsToReconcileNetIncomeLossToCashProvidedByUsedInOperatingActivitiesOther\n",
      "AdjustmentsToAdditionalPaidInCapitalEquityComponentOfConvertibleDebtSubsequentAdjustments\n",
      "AdjustmentsToAdditionalPaidInCapitalOther\n",
      "AdjustmentsToAdditionalPaidInCapitalSharebasedCompensationRequisiteServicePeriodRecognitionValue\n",
      "AdjustmentsToAdditionalPaidInCapitalTaxEffectFromShareBasedCompensation\n",
      "AdjustmentsToAdditionalPaidInCapitalWarrantIssued\n",
      "AdjustmentToAdditionalPaidInCapitalIncomeTaxEffectFromShareBasedCompensationNet\n",
      "AllocatedShareBasedCompensationExpense\n",
      "AllowanceForDoubtfulAccountsReceivableCurrent\n",
      "AmortizationOfAcquiredIntangibleAssets\n",
      "AmortizationOfDebtDiscountPremium\n",
      "AmortizationOfDeferredSalesCommissions\n",
      "AmortizationOfFinancingCosts\n",
      "AmortizationOfFinancingCostsAndDiscounts\n",
      "AmortizationOfIntangibleAssets\n",
      "AntidilutiveSecuritiesExcludedFromComputationOfEarningsPerShareAmount\n",
      "Assets\n",
      "AssetsCurrent\n",
      "AssetsHeldForSaleNotPartOfDisposalGroup\n",
      "AvailableForSaleDebtSecuritiesAccumulatedGrossUnrealizedGainBeforeTax\n",
      "AvailableForSaleDebtSecuritiesAccumulatedGrossUnrealizedLossBeforeTax\n",
      "AvailableForSaleDebtSecuritiesAmortizedCostBasis\n",
      "AvailableForSaleSecurities\n",
      "AvailableForSaleSecuritiesAccumulatedGrossUnrealizedGainBeforeTax\n",
      "AvailableForSaleSecuritiesAccumulatedGrossUnrealizedLossBeforeTax\n",
      "AvailableForSaleSecuritiesAmortizedCost\n",
      "AvailableForSaleSecuritiesContinuousUnrealizedLossPosition12MonthsOrLongerAccumulatedLoss\n",
      "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionAccumulatedLoss\n",
      "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionFairValue\n",
      "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionLessThan12MonthsAccumulatedLoss\n",
      "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionLessThanTwelveMonthsFairValue\n",
      "AvailableForSaleSecuritiesContinuousUnrealizedLossPositionTwelveMonthsOrLongerFairValue\n",
      "AvailableForSaleSecuritiesCurrent\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAfterFiveThroughTenYearsAmortizedCost\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAfterFiveThroughTenYearsFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAfterOneThroughFiveYearsAmortizedCost\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAfterOneThroughFiveYearsFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAfterTenYearsAmortizedCost\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAfterTenYearsFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesAmortizedCost\n",
      "AvailableForSaleSecuritiesDebtMaturitiesFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesNextRollingTwelveMonthsAmortizedCostBasis\n",
      "AvailableForSaleSecuritiesDebtMaturitiesNextRollingTwelveMonthsFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesRollingAfterYearTenAmortizedCostBasis\n",
      "AvailableForSaleSecuritiesDebtMaturitiesRollingAfterYearTenFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesRollingYearSixThroughTenAmortizedCostBasis\n",
      "AvailableForSaleSecuritiesDebtMaturitiesRollingYearSixThroughTenFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesRollingYearTwoThroughFiveAmortizedCostBasis\n",
      "AvailableForSaleSecuritiesDebtMaturitiesRollingYearTwoThroughFiveFairValue\n",
      "AvailableForSaleSecuritiesDebtMaturitiesSingleMaturityDate\n",
      "AvailableForSaleSecuritiesDebtMaturitiesSingleMaturityDateAmortizedCostBasis\n",
      "AvailableForSaleSecuritiesDebtMaturitiesWithinOneYearAmortizedCost\n",
      "AvailableForSaleSecuritiesDebtMaturitiesWithinOneYearFairValue\n",
      "AvailableForSaleSecuritiesDebtSecurities\n",
      "AvailableForSaleSecuritiesDebtSecuritiesNoncurrent\n",
      "AvailableForSaleSecuritiesFairValueDisclosure\n",
      "AvailableForSaleSecuritiesGrossUnrealizedGains\n",
      "AvailableForSaleSecuritiesGrossUnrealizedLoss\n",
      "AvailableForSaleSecuritiesGrossUnrealizedLosses1\n",
      "AvailableforsaleSecuritiesContinuousUnrealizedLossPosition12MonthsOrLongerAggregateLosses1\n",
      "AvailableforsaleSecuritiesContinuousUnrealizedLossPosition12MonthsOrLongerAggregateLosses2\n",
      "AvailableforsaleSecuritiesContinuousUnrealizedLossPositionAggregateLosses1\n",
      "AvailableforsaleSecuritiesContinuousUnrealizedLossPositionAggregateLosses2\n",
      "AvailableforsaleSecuritiesContinuousUnrealizedLossPositionLessThan12MonthsAggregateLosses1\n",
      "AvailableforsaleSecuritiesContinuousUnrealizedLossPositionLessThan12MonthsAggregateLosses2\n",
      "AvailableforsaleSecuritiesGrossUnrealizedGain\n",
      "BuildingsAndImprovementsGross\n",
      "BusinessAcquisitionCostOfAcquiredEntityCashPaid\n",
      "BusinessAcquisitionCostOfAcquiredEntityEquityInterestsIssuedAndIssuable\n",
      "BusinessAcquisitionCostOfAcquiredEntityPurchasePrice\n",
      "BusinessAcquisitionCostOfAcquiredEntityTransactionCosts\n",
      "BusinessAcquisitionPurchasePriceAllocationAmortizableIntangibleAssets\n",
      "BusinessAcquisitionPurchasePriceAllocationAssetsAcquired\n",
      "BusinessAcquisitionPurchasePriceAllocationAssetsAcquiredLiabilitiesAssumedNet\n",
      "BusinessAcquisitionPurchasePriceAllocationCurrentAssets\n",
      "BusinessAcquisitionPurchasePriceAllocationCurrentAssetsCashAndCashEquivalents\n",
      "BusinessAcquisitionPurchasePriceAllocationCurrentLiabilities\n",
      "BusinessAcquisitionPurchasePriceAllocationCurrentLiabilitiesDeferredRevenue\n",
      "BusinessAcquisitionPurchasePriceAllocationDeferredIncomeTaxesAssetLiabilityNet\n",
      "BusinessAcquisitionPurchasePriceAllocationGoodwillAmount\n",
      "BusinessAcquisitionPurchasePriceAllocationOtherNoncurrentAssets\n",
      "BusinessAcquisitionPurchasePriceAllocationOtherNoncurrentLiabilities\n",
      "BusinessAcquisitionPurchasePriceAllocationPropertyPlantAndEquipment\n",
      "BusinessAcquisitionsProFormaNetIncomeLoss\n",
      "BusinessAcquisitionsProFormaRevenue\n",
      "BusinessCombinationAcquisitionRelatedCosts\n",
      "BusinessCombinationConsiderationTransferredEquityInterestsIssuedAndIssuable\n",
      "BusinessCombinationIntegrationRelatedCosts\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedAssets\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedCashAndEquivalents\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedCurrentAssetsOther\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedCurrentLiabilities\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedDeferredTaxLiabilitiesNoncurrent\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedIntangibles\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedNoncurrentAssets\n",
      "BusinessCombinationRecognizedIdentifiableAssetsAcquiredGoodwillAndLiabilitiesAssumedNet\n",
      "CapitalExpendituresIncurredButNotYetPaid\n",
      "CapitalizedComputerSoftwareAmortization\n",
      "CapitalizedComputerSoftwareGross\n",
      "CapitalizedComputerSoftwareNet\n",
      "CapitalizedContractCostNet\n",
      "CapitalizedContractCostNetCurrent\n",
      "CapitalizedContractCostNetNoncurrent\n",
      "Cash\n",
      "CashAndCashEquivalentsAtCarryingValue\n",
      "CashAndCashEquivalentsFairValueDisclosure\n",
      "CashAndCashEquivalentsPeriodIncreaseDecrease\n",
      "CashCashEquivalentsAndShortTermInvestments\n",
      "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents\n",
      "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalentsPeriodIncreaseDecreaseIncludingExchangeRateEffect\n",
      "CashEquivalentsAtCarryingValue\n",
      "ChangeInUnrealizedGainLossOnHedgedItemInFairValueHedge\n",
      "ClassOfWarrantOrRightExercisePriceOfWarrantsOrRights\n",
      "ClassOfWarrantOrRightOutstanding\n",
      "CommercialPaper\n",
      "CommitmentsAndContingencies\n",
      "CommonStockDividendsPerShareDeclared\n",
      "CommonStockParOrStatedValuePerShare\n",
      "CommonStockSharesAuthorized\n",
      "CommonStockSharesIssued\n",
      "CommonStockSharesOutstanding\n",
      "CommonStocksIncludingAdditionalPaidInCapital\n",
      "CommonStockValue\n",
      "ComprehensiveIncomeNetOfTax\n",
      "ComprehensiveIncomeNetOfTaxIncludingPortionAttributableToNoncontrollingInterest\n",
      "ConcentrationRiskPercentage\n",
      "ConcentrationRiskPercentage1\n",
      "ConstructionInProgressGross\n",
      "ContractWithCustomerLiability\n",
      "ContractWithCustomerLiabilityCurrent\n",
      "ContractWithCustomerLiabilityNoncurrent\n",
      "ContractWithCustomerLiabilityRevenueRecognized\n",
      "ConvertibleDebtCurrent\n",
      "ConvertibleDebtNoncurrent\n",
      "CostOfGoodsAndServicesSold\n",
      "CostOfGoodsSold\n",
      "CostOfRevenue\n",
      "CostOfServices\n",
      "CumulativeEffectOfNewAccountingPrincipleInPeriodOfAdoption\n",
      "CumulativeEffectOnRetainedEarningsNetOfTax1\n",
      "CurrentFederalTaxExpenseBenefit\n",
      "CurrentForeignTaxExpenseBenefit\n",
      "CurrentIncomeTaxExpenseBenefit\n",
      "CurrentStateAndLocalTaxExpenseBenefit\n",
      "DebtConversionConvertedInstrumentAmount1\n",
      "DebtInstrumentConvertibleCarryingAmountOfTheEquityComponent\n",
      "DebtInstrumentConvertibleConversionPrice\n",
      "DebtInstrumentConvertibleConversionPrice1\n",
      "DebtInstrumentConvertibleEffectiveInterestRate\n",
      "DebtInstrumentConvertibleInterestExpense\n",
      "DebtInstrumentConvertibleRemainingDiscountAmortizationPeriod\n",
      "DebtInstrumentFaceAmount\n",
      "DebtInstrumentFairValue\n",
      "DebtInstrumentInterestRateStatedPercentage\n",
      "DebtInstrumentUnamortizedDiscount\n",
      "DebtRelatedCommitmentFeesAndDebtIssuanceCosts\n",
      "DecreaseInUnrecognizedTaxBenefitsIsReasonablyPossible\n",
      "DeferredCompensationCashBasedArrangementsLiabilityCurrent\n",
      "DeferredCompensationCashbasedArrangementsLiabilityClassifiedNoncurrent\n",
      "DeferredCompensationLiabilityCurrent\n",
      "DeferredCompensationPlanAssets\n",
      "DeferredFederalIncomeTaxExpenseBenefit\n",
      "DeferredForeignIncomeTaxExpenseBenefit\n",
      "DeferredIncomeTaxAssetsNet\n",
      "DeferredIncomeTaxExpenseBenefit\n",
      "DeferredIncomeTaxesAndTaxCredits\n",
      "DeferredRevenue\n",
      "DeferredRevenueAndCredits\n",
      "DeferredRevenueAndCreditsCurrent\n",
      "DeferredRevenueAndCreditsNoncurrent\n",
      "DeferredRevenueCurrent\n",
      "DeferredRevenueNoncurrent\n",
      "DeferredRevenueRevenueRecognized1\n",
      "DeferredStateAndLocalIncomeTaxExpenseBenefit\n",
      "DeferredTaxAssetsDeferredIncome\n",
      "DeferredTaxAssetsGoodwillAndIntangibleAssets\n",
      "DeferredTaxAssetsGross\n",
      "DeferredTaxAssetsInventory\n",
      "DeferredTaxAssetsLiabilitiesNet\n",
      "DeferredTaxAssetsLiabilitiesNetCurrent\n",
      "DeferredTaxAssetsLiabilitiesNetNoncurrent\n",
      "DeferredTaxAssetsNet\n",
      "DeferredTaxAssetsNetCurrent\n",
      "DeferredTaxAssetsNetNoncurrent\n",
      "DeferredTaxAssetsOther\n",
      "DeferredTaxAssetsTaxDeferredExpenseCompensationAndBenefitsShareBasedCompensationCost\n",
      "DeferredTaxAssetsTaxDeferredExpenseReservesAndAccrualsReserves\n",
      "DeferredTaxAssetsUnrealizedLossesOnAvailableforSaleSecuritiesGross\n",
      "DeferredTaxAssetsValuationAllowance\n",
      "DeferredTaxLiabilities\n",
      "DeferredTaxLiabilitiesDeferredExpenseReservesAndAccruals\n",
      "DeferredTaxLiabilitiesFinancingArrangements\n",
      "DeferredTaxLiabilitiesGoodwillAndIntangibleAssetsIntangibleAssets\n",
      "DeferredTaxLiabilitiesOther\n",
      "DeferredTaxLiabilitiesPropertyPlantAndEquipment\n",
      "DeferredTaxLiabilityNotRecognizedAmountOfUnrecognizedDeferredTaxLiability\n",
      "DeferredTaxLiabilityNotRecognizedAmountOfUnrecognizedDeferredTaxLiabilityUndistributedEarningsOfForeignSubsidiaries\n",
      "DeferredTaxLiabilityNotRecognizedCumulativeAmountOfTemporaryDifference\n",
      "DefinedBenefitPlanAccumulatedOtherComprehensiveIncomeLossAfterTax\n",
      "DefinedBenefitPlanBenefitObligation\n",
      "DefinedBenefitPlanFairValueOfPlanAssets\n",
      "DefinedBenefitPlanFundedStatusOfPlan\n",
      "DefinedBenefitPlanPlanAmendments\n",
      "DefinedContributionPlanCostRecognized\n",
      "Depreciation\n",
      "DepreciationAndAmortization\n",
      "DepreciationDepletionAndAmortization\n",
      "DerivativeAssets\n",
      "DerivativeFinancialInstrumentsLiabilitiesFairValueDisclosure\n",
      "DerivativeGainLossOnDerivativeNet\n",
      "DerivativeInstrumentsGainLossReclassifiedFromAccumulatedOCIIntoIncomeEffectivePortionNet\n",
      "DerivativeInstrumentsGainLossRecognizedInIncomeNet\n",
      "DerivativeInstrumentsGainLossRecognizedInOtherComprehensiveIncomeEffectivePortionNet\n",
      "DerivativeLiabilities\n",
      "DerivativeLossOnDerivative\n",
      "DividendsCommonStockCash\n",
      "EarningsPerShareBasic\n",
      "EarningsPerShareDiluted\n",
      "EffectiveIncomeTaxRateContinuingOperations\n",
      "EffectiveIncomeTaxRateReconciliationAtFederalStatutoryIncomeTaxRate\n",
      "EffectOfExchangeRateOnCashAndCashEquivalents\n",
      "EffectOfExchangeRateOnCashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents\n",
      "EmployeeRelatedLiabilitiesCurrent\n",
      "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognized\n",
      "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognizedPeriodForRecognition\n",
      "EmployeeServiceShareBasedCompensationTaxBenefitFromCompensationExpense\n",
      "EntityWideDisclosureOnGeographicAreasLongLivedAssetsInEntitysCountryOfDomicile\n",
      "EntityWideDisclosureOnGeographicAreasLongLivedAssetsInForeignCountries\n",
      "EntityWideDisclosureOnGeographicAreasRevenueFromExternalCustomersAttributedToEntitysCountryOfDomicile\n",
      "EquityMethodInvestmentOtherThanTemporaryImpairment\n",
      "ExcessTaxBenefitFromShareBasedCompensationFinancingActivities\n",
      "ExcessTaxBenefitFromShareBasedCompensationOperatingActivities\n",
      "FairValueAssetsMeasuredOnRecurringBasisCashAndCashEquivalents\n",
      "FairValueMeasuredOnRecurringBasisInvestments\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetGainLossIncludedInEarnings\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetGainLossIncludedInEarnings1\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetGainLossIncludedInOtherComprehensiveIncome\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetGainLossIncludedInOtherComprehensiveIncomeLoss\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetPurchasesSalesIssuancesSettlements\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetSales\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetSettlements\n",
      "FairValueMeasurementWithUnobservableInputsReconciliationRecurringBasisAssetValue\n",
      "FairValueOfAssetsAcquired\n",
      "FiniteLivedIntangibleAssetsAccumulatedAmortization\n",
      "FiniteLivedIntangibleAssetsAmortizationExpense\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseAfterYearFive\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseNextTwelveMonths\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseRemainderOfFiscalYear\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseYearFive\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseYearFour\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseYearThree\n",
      "FiniteLivedIntangibleAssetsAmortizationExpenseYearTwo\n",
      "FiniteLivedIntangibleAssetsFutureAmortizationExpense\n",
      "FiniteLivedIntangibleAssetsGross\n",
      "FiniteLivedIntangibleAssetsNet\n",
      "ForeignCurrencyContractAssetFairValueDisclosure\n",
      "ForeignCurrencyContractsLiabilityFairValueDisclosure\n",
      "FurnitureAndFixturesGross\n",
      "FutureAmortizationExpenseAfterYearFive\n",
      "FutureAmortizationExpenseRemainderOfFiscalYear\n",
      "FutureAmortizationExpenseYearFive\n",
      "FutureAmortizationExpenseYearFour\n",
      "FutureAmortizationExpenseYearOne\n",
      "FutureAmortizationExpenseYearThree\n",
      "FutureAmortizationExpenseYearTwo\n",
      "GainLossOnForeignCurrencyFairValueHedgeDerivatives\n",
      "GainLossOnSaleOfPropertyPlantEquipment\n",
      "GeneralAndAdministrativeExpense\n",
      "Goodwill\n",
      "GoodwillAcquiredDuringPeriod\n",
      "GoodwillImpairmentLoss\n",
      "GoodwillSubsequentRecognitionOfDeferredTaxAsset\n",
      "GoodwillWrittenOffRelatedToSaleOfBusinessUnit\n",
      "GrossProfit\n",
      "GuaranteeObligationsCurrentCarryingValue\n",
      "GuaranteeObligationsMaximumExposure\n",
      "ImpairmentOfIntangibleAssetsFinitelived\n",
      "IncomeLossFromContinuingOperationsBeforeIncomeTaxesDomestic\n",
      "IncomeLossFromContinuingOperationsBeforeIncomeTaxesExtraordinaryItemsNoncontrollingInterest\n",
      "IncomeLossFromContinuingOperationsBeforeIncomeTaxesForeign\n",
      "IncomeLossFromContinuingOperationsBeforeIncomeTaxesMinorityInterestAndIncomeLossFromEquityMethodInvestments\n",
      "IncomeTaxExaminationLiabilityRefundAdjustmentFromSettlementWithTaxingAuthority\n",
      "IncomeTaxExpenseBenefit\n",
      "IncomeTaxExpenseBenefitExtraordinaryItems\n",
      "IncomeTaxesPaid\n",
      "IncomeTaxesPaidNet\n",
      "IncomeTaxHolidayIncomeTaxBenefitsPerShare\n",
      "IncomeTaxReconciliationChangeInEnactedTaxRate\n",
      "IncomeTaxReconciliationDeductionsQualifiedProductionActivities\n",
      "IncomeTaxReconciliationForeignIncomeTaxRateDifferential\n",
      "IncomeTaxReconciliationIncomeTaxExpenseBenefitAtFederalStatutoryIncomeTaxRate\n",
      "IncomeTaxReconciliationNondeductibleExpenseShareBasedCompensationCost\n",
      "IncomeTaxReconciliationOtherReconcilingItems\n",
      "IncomeTaxReconciliationStateAndLocalIncomeTaxes\n",
      "IncomeTaxReconciliationTaxCredits\n",
      "IncomeTaxReconciliationTaxCreditsResearch\n",
      "IncomeTaxReconciliationTaxHolidays\n",
      "IncomeTaxReconciliationTaxSettlements\n",
      "IncreaseDecreaseInAccountsPayableTrade\n",
      "IncreaseDecreaseInAccountsReceivable\n",
      "IncreaseDecreaseInAccruedIncomeTaxesPayable\n",
      "IncreaseDecreaseInAccruedLiabilities\n",
      "IncreaseDecreaseInContractWithCustomerLiability\n",
      "IncreaseDecreaseInDeferredRevenue\n",
      "IncreaseDecreaseInDeferredRevenueAndCustomerAdvancesAndDeposits\n",
      "IncreaseDecreaseInInventories\n",
      "IncreaseDecreaseInOtherNoncurrentLiabilities\n",
      "IncreaseDecreaseInOtherOperatingAssets\n",
      "IncreaseDecreaseInOtherOperatingLiabilities\n",
      "IncrementalCommonSharesAttributableToCallOptionsAndWarrants\n",
      "IncrementalCommonSharesAttributableToConversionOfDebtSecurities\n",
      "IncrementalCommonSharesAttributableToShareBasedPaymentArrangements\n",
      "IntangibleAssetsNetExcludingGoodwill\n",
      "InterestCostsIncurred\n",
      "InterestCostsIncurredCapitalized\n",
      "InterestExpense\n",
      "InterestExpenseDebt\n",
      "InterestExpenseDebtExcludingAmortization\n",
      "InterestPaid\n",
      "InterestPaidCapitalized\n",
      "InterestPaidNet\n",
      "InventoryFinishedGoodsNetOfReserves\n",
      "InventoryNet\n",
      "InventoryRawMaterialsNetOfReserves\n",
      "InventoryWorkInProcessNetOfReserves\n",
      "InvestmentIncomeInterest\n",
      "InvestmentIncomeNet\n",
      "InvestmentsFairValueDisclosure\n",
      "Land\n",
      "LandAndLandImprovements\n",
      "LeaseAndRentalExpense\n",
      "LeaseCost\n",
      "LeaseholdImprovementsGross\n",
      "LesseeOperatingLeaseLiabilityPaymentsDue\n",
      "LesseeOperatingLeaseLiabilityPaymentsDueAfterYearFive\n",
      "LesseeOperatingLeaseLiabilityPaymentsDueNextTwelveMonths\n",
      "LesseeOperatingLeaseLiabilityPaymentsDueYearFive\n",
      "LesseeOperatingLeaseLiabilityPaymentsDueYearFour\n",
      "LesseeOperatingLeaseLiabilityPaymentsDueYearThree\n",
      "LesseeOperatingLeaseLiabilityPaymentsDueYearTwo\n",
      "LesseeOperatingLeaseLiabilityPaymentsRemainderOfFiscalYear\n",
      "LesseeOperatingLeaseLiabilityUndiscountedExcessAmount\n",
      "Liabilities\n",
      "LiabilitiesAndStockholdersEquity\n",
      "LiabilitiesCurrent\n",
      "LiabilityForUncertainTaxPositionsNoncurrent\n",
      "LongTermDebt\n",
      "LongTermDebtCurrent\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalAfterYearFive\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalInNextTwelveMonths\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFive\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFour\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearThree\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearTwo\n",
      "LongTermDebtMaturitiesRepaymentsOfPrincipalRemainderOfFiscalYear\n",
      "LongTermDebtNoncurrent\n",
      "LossContingencyAccrualAtCarryingValue\n",
      "MachineryAndEquipmentGross\n",
      "MinimumLeasePaymentsSaleLeasebackTransactionsWithinOneYear\n",
      "NetCashProvidedByUsedInFinancingActivities\n",
      "NetCashProvidedByUsedInFinancingActivitiesContinuingOperations\n",
      "NetCashProvidedByUsedInInvestingActivities\n",
      "NetCashProvidedByUsedInInvestingActivitiesContinuingOperations\n",
      "NetCashProvidedByUsedInOperatingActivities\n",
      "NetCashProvidedByUsedInOperatingActivitiesContinuingOperations\n",
      "NetIncomeLoss\n",
      "NewAccountingPronouncementOrChangeInAccountingPrincipleEffectOfChangeOnNetIncome\n",
      "NewAccountingPronouncementOrChangeInAccountingPrincipleEffectOfChangeOnNetRevenue\n",
      "NoncashOrPartNoncashAcquisitionFixedAssetsAcquired\n",
      "NoncashOrPartNoncashAcquisitionFixedAssetsAcquired1\n",
      "NonoperatingIncomeExpense\n",
      "NotesReduction\n",
      "NumberOfOperatingSegments\n",
      "NumberOfReportableSegments\n",
      "OciBeforeReclassificationsNetOfTaxAttributableToParent\n",
      "OperatingExpenses\n",
      "OperatingIncomeLoss\n",
      "OperatingLeaseCost\n",
      "OperatingLeaseLiability\n",
      "OperatingLeaseLiabilityCurrent\n",
      "OperatingLeaseLiabilityNoncurrent\n",
      "OperatingLeasePayments\n",
      "OperatingLeaseRightOfUseAsset\n",
      "OperatingLeasesFutureMinimumPaymentsDue\n",
      "OperatingLeasesFutureMinimumPaymentsDueCurrent\n",
      "OperatingLeasesFutureMinimumPaymentsDueInFiveYears\n",
      "OperatingLeasesFutureMinimumPaymentsDueInFourYears\n",
      "OperatingLeasesFutureMinimumPaymentsDueInThreeYears\n",
      "OperatingLeasesFutureMinimumPaymentsDueInTwoYears\n",
      "OperatingLeasesFutureMinimumPaymentsDueThereafter\n",
      "OperatingLeasesFutureMinimumPaymentsRemainderOfFiscalYear\n",
      "OperatingLeasesRentExpenseNet\n",
      "OperatingLeasesRentExpenseSubleaseRentals1\n",
      "OperatingLeaseWeightedAverageDiscountRatePercent\n",
      "OptionIndexedToIssuersEquityShares\n",
      "OtherAccruedLiabilitiesCurrent\n",
      "OtherAssetsCurrent\n",
      "OtherAssetsMiscellaneousCurrent\n",
      "OtherAssetsMiscellaneousNoncurrent\n",
      "OtherAssetsNoncurrent\n",
      "OtherComprehensiveIncomeAvailableForSaleSecuritiesAdjustmentNetOfTaxPeriodIncreaseDecrease\n",
      "OtherComprehensiveIncomeDefinedBenefitPlanNetPriorServiceCostsCreditArisingDuringPeriodNetOfTax\n",
      "OtherComprehensiveIncomeDefinedBenefitPlansAdjustmentNetOfTaxPeriodIncreaseDecrease\n",
      "OtherComprehensiveIncomeDefinedBenefitPlansNetUnamortizedGainLossArisingDuringPeriodTax\n",
      "OtherComprehensiveIncomeDerivativesQualifyingAsHedgesNetOfTaxPeriodIncreaseDecrease\n",
      "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationAdjustmentNetOfTaxPeriodIncreaseDecrease\n",
      "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationGainLossBeforeReclassificationAndTax\n",
      "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentBeforeReclassificationAdjustmentsAndTax\n",
      "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesTax\n",
      "OtherComprehensiveIncomeLossBeforeReclassificationsNetOfTax\n",
      "OtherComprehensiveIncomeLossCashFlowHedgeGainLossBeforeReclassificationAndTax\n",
      "OtherComprehensiveIncomeLossCashFlowHedgeGainLossReclassificationBeforeTax\n",
      "OtherComprehensiveIncomeLossNetOfTax\n",
      "OtherComprehensiveIncomeLossNetOfTaxPortionAttributableToParent\n",
      "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansAdjustmentBeforeReclassificationAdjustmentsAndTax\n",
      "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansBenefitPlanImprovementTaxEffect\n",
      "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansTax\n",
      "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeBeforeTax\n",
      "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesBeforeTax\n",
      "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIOnDerivativesBeforeTax\n",
      "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansBeforeTax\n",
      "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetGainLossBeforeTax\n",
      "OtherComprehensiveIncomeLossReclassificationAdjustmentOnDerivativesIncludedInNetIncomeBeforeTax\n",
      "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodBeforeTax\n",
      "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodNetOfTax\n",
      "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodBeforeTax\n",
      "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodNetOfTax\n",
      "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodTax\n",
      "OtherLiabilitiesCurrent\n",
      "OtherLiabilitiesFairValueDisclosure\n",
      "OtherLiabilitiesNoncurrent\n",
      "OtherLongTermDebt\n",
      "OtherLongTermDebtCurrent\n",
      "OtherLongTermDebtNoncurrent\n",
      "OtherNoncashIncomeExpense\n",
      "OtherNoncurrentLiabilities\n",
      "OtherNonoperatingIncomeExpense\n",
      "OtherOperatingActivitiesCashFlowStatement\n",
      "OtherTaxCarryforwardValuationAllowance\n",
      "OtherThanTemporaryImpairmentLossesInvestmentsPortionRecognizedInEarningsNetAvailableforsaleSecurities\n",
      "PaymentsForProceedsFromOtherInvestingActivities\n",
      "PaymentsForRepurchaseOfCommonStock\n",
      "PaymentsForRepurchaseOfEquity\n",
      "PaymentsForRestructuring\n",
      "PaymentsOfDividends\n",
      "PaymentsOfStockIssuanceCosts\n",
      "PaymentsRelatedToTaxWithholdingForShareBasedCompensation\n",
      "PaymentsToAcquireAvailableForSaleSecurities\n",
      "PaymentsToAcquireBusinessesGross\n",
      "PaymentsToAcquireBusinessesNetOfCashAcquired\n",
      "PaymentsToAcquireInvestments\n",
      "PaymentsToAcquirePropertyPlantAndEquipment\n",
      "PensionAndOtherPostretirementDefinedBenefitPlansLiabilitiesNoncurrent\n",
      "PreferredStockParOrStatedValuePerShare\n",
      "PreferredStockSharesAuthorized\n",
      "PreferredStockSharesIssued\n",
      "PreferredStockSharesOutstanding\n",
      "PreferredStockValue\n",
      "PrepaidExpenseAndOtherAssetsCurrent\n",
      "PrepaidExpenseAndOtherAssetsNoncurrent\n",
      "ProceedsFromIncomeTaxRefunds\n",
      "ProceedsFromIssuanceOfCommonStock\n",
      "ProceedsFromIssuanceOfDebt\n",
      "ProceedsFromIssuanceOfLongTermDebt\n",
      "ProceedsFromIssuanceOfSharesUnderIncentiveAndShareBasedCompensationPlansIncludingStockOptions\n",
      "ProceedsFromIssuanceOfWarrants\n",
      "ProceedsFromMaturitiesPrepaymentsAndCallsOfAvailableForSaleSecurities\n",
      "ProceedsFromRepaymentsOfCommercialPaper\n",
      "ProceedsFromRepaymentsOfOtherLongTermDebt\n",
      "ProceedsFromSaleAndCollectionOfFinanceReceivables\n",
      "ProceedsFromSaleMaturityAndCollectionsOfInvestments\n",
      "ProceedsFromSaleOfPropertyPlantAndEquipment\n",
      "ProceedsFromShortTermDebt\n",
      "ProceedsFromStockOptionsExercised\n",
      "ProceedsFromStockPlans\n",
      "ProceedsFromWarrantExercises\n",
      "ProductWarrantyAccrual\n",
      "ProductWarrantyAccrualAdditionsFromBusinessAcquisition\n",
      "ProductWarrantyAccrualClassifiedCurrent\n",
      "ProductWarrantyAccrualNoncurrent\n",
      "ProductWarrantyAccrualWarrantiesIssued\n",
      "ProductWarrantyExpense\n",
      "PropertyPlantAndEquipmentGross\n",
      "PropertyPlantAndEquipmentNet\n",
      "ReclassificationFromAccumulatedOtherComprehensiveIncomeCurrentPeriodNetOfTax\n",
      "ReclassificationFromAociCurrentPeriodNetOfTaxAttributableToParent\n",
      "RepaymentsOfDebt\n",
      "RepaymentsOfLongTermDebt\n",
      "RepaymentsOfOtherLongTermDebt\n",
      "RepaymentsOfShortTermDebt\n",
      "ResearchAndDevelopmentExpense\n",
      "RestrictedCash\n",
      "RestrictedCashAndCashEquivalentsAtCarryingValue\n",
      "RestrictedCashAndCashEquivalentsNoncurrent\n",
      "RestrictedCashCurrent\n",
      "RestrictedCashNoncurrent\n",
      "RestructuringAndRelatedCostNumberOfPositionsEliminatedInceptionToDatePercent\n",
      "RestructuringCharges\n",
      "RestructuringReserve\n",
      "RestructuringReserveSettledWithCash\n",
      "RestructuringReserveSettledWithoutCash\n",
      "RestructuringReserveTranslationAdjustment\n",
      "RestructuringReserveTranslationAndOtherAdjustment\n",
      "RetainedEarningsAccumulatedDeficit\n",
      "RevenueFromContractWithCustomerExcludingAssessedTax\n",
      "RevenueRemainingPerformanceObligation\n",
      "RevenueRemainingPerformanceObligationPercentage\n",
      "Revenues\n",
      "RightOfUseAssetObtainedInExchangeForOperatingLeaseLiability\n",
      "SaleLeasebackTransactionAmountDueUnderFinancingArrangement\n",
      "SaleLeasebackTransactionCurrentPeriodGainRecognized\n",
      "SaleLeasebackTransactionNetProceedsFinancingActivities\n",
      "SalesRevenueGoodsNet\n",
      "SalesRevenueNet\n",
      "SalesRevenueServicesNet\n",
      "SellingAndMarketingExpense\n",
      "ShareBasedCompensation\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardDiscountFromMarketPrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardDiscountFromMarketPricePurchaseDate\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsForfeitedInPeriod\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsForfeitedInPeriodWeightedAverageGrantDateFairValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsGrantsInPeriod\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsGrantsInPeriodWeightedAverageGrantDateFairValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsNonvestedNumber\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsNonvestedWeightedAverageGrantDateFairValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriod\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardEquityInstrumentsOtherThanOptionsVestedInPeriodWeightedAverageGrantDateFairValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardFairValueAssumptionsExpectedDividendPayments\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableNumber\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableWeightedAverageRemainingContractualTerm\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriodTotalIntrinsicValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriodWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsForfeituresAndExpirationsInPeriod\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsForfeituresAndExpirationsInPeriodWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriod\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriodGross\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriodWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsGrantsInPeriodWeightedAverageGrantDateFairValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOtherIncreasesDecreasesInPeriod\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingIntrinsicValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingNumber\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedAndExpectedToVestOutstandingAggregateIntrinsicValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedAndExpectedToVestOutstandingNumber\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedAndExpectedToVestOutstandingWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedAndExpectedToVestOutstandingWeightedAverageRemainingContractualTerm\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedInPeriodFairValue\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardPerShareWeightedAveragePriceOfSharesPurchased\n",
      "ShareBasedCompensationArrangementByShareBasedPaymentAwardSharesIssuedInPeriod\n",
      "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsExercisesInPeriodWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsExpirationsInPeriodWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsGrantsInPeriodWeightedAverageExercisePrice\n",
      "ShareBasedCompensationArrangementsByShareBasedPaymentAwardOptionsOtherShareIncreaseDecreaseInPeriodWeightedAverageExercisePrice\n",
      "SharebasedCompensationArrangementBySharebasedPaymentAwardOptionsExercisableIntrinsicValue1\n",
      "SharebasedCompensationArrangementBySharebasedPaymentAwardOptionsOutstandingWeightedAverageRemainingContractualTerm1\n",
      "SharebasedCompensationArrangementBySharebasedPaymentAwardOptionsVestedInPeriodFairValue1\n",
      "SharebasedCompensationArrangementBySharebasedPaymentAwardPurchasePriceOfCommonStockPercent\n",
      "ShortTermBorrowings\n",
      "ShortTermDebtWeightedAverageInterestRate\n",
      "ShortTermInvestments\n",
      "SignificantChangeInUnrecognizedTaxBenefitsIsReasonablyPossibleEstimatedRangeOfChangeLowerBound\n",
      "SignificantChangeInUnrecognizedTaxBenefitsIsReasonablyPossibleEstimatedRangeOfChangeUpperBound\n",
      "StandardProductWarrantyAccrual\n",
      "StandardProductWarrantyAccrualCurrent\n",
      "StandardProductWarrantyAccrualNoncurrent\n",
      "StandardProductWarrantyAccrualPayments\n",
      "StandardProductWarrantyAccrualWarrantiesIssued\n",
      "StockholdersEquity\n",
      "StockIssuedDuringPeriodSharesEmployeeStockPurchasePlans\n",
      "StockIssuedDuringPeriodSharesStockOptionsExercised\n",
      "StockIssuedDuringPeriodValueAcquisitions\n",
      "StockIssuedDuringPeriodValueEmployeeStockPurchasePlan\n",
      "StockIssuedDuringPeriodValueNewIssues\n",
      "StockIssuedDuringPeriodValueShareBasedCompensation\n",
      "StockRepurchasedAndRetiredDuringPeriodShares\n",
      "StockRepurchasedAndRetiredDuringPeriodValue\n",
      "StockRepurchasedDuringPeriodShares\n",
      "StockRepurchasedDuringPeriodValue\n",
      "StockRepurchaseProgramAuthorizedAmount\n",
      "StockRepurchaseProgramAuthorizedAmount1\n",
      "StockRepurchaseProgramNumberOfSharesAuthorizedToBeRepurchased\n",
      "StockRepurchaseProgramRemainingAuthorizedRepurchaseAmount\n",
      "StockRepurchaseProgramRemainingAuthorizedRepurchaseAmount1\n",
      "TaxAdjustmentsSettlementsAndUnusualProvisions\n",
      "TaxBenefitFromStockOptionsExercised\n",
      "TaxBenefitFromStockOptionsExercised1\n",
      "TaxCreditCarryforwardAmount\n",
      "TaxCreditCarryforwardValuationAllowance\n",
      "TaxCutsAndJobsActOf2017IncompleteAccountingChangeInTaxRateProvisionalIncomeTaxExpenseBenefit\n",
      "TransferOfOtherRealEstate\n",
      "TreasuryStockAcquiredAverageCostPerShare\n",
      "TreasuryStockRetiredCostMethodAmount\n",
      "TreasuryStockShares\n",
      "TreasuryStockSharesAcquired\n",
      "TreasuryStockSharesRetired\n",
      "TreasuryStockValue\n",
      "UnamortizedDebtIssuanceExpense\n",
      "UndistributedEarningsOfForeignSubsidiaries\n",
      "UnrecognizedTaxBenefits\n",
      "UnrecognizedTaxBenefitsDecreasesResultingFromPriorPeriodTaxPositions\n",
      "UnrecognizedTaxBenefitsDecreasesResultingFromSettlementsWithTaxingAuthorities\n",
      "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestAccrued\n",
      "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestExpense\n",
      "UnrecognizedTaxBenefitsIncreasesResultingFromCurrentPeriodTaxPositions\n",
      "UnrecognizedTaxBenefitsIncreasesResultingFromPriorPeriodTaxPositions\n",
      "UnrecognizedTaxBenefitsIncreasesResultingFromSettlementsWithTaxingAuthorities\n",
      "UnrecognizedTaxBenefitsReductionsResultingFromLapseOfApplicableStatuteOfLimitations\n",
      "UnrecognizedTaxBenefitsThatWouldImpactEffectiveTaxRate\n",
      "UnrecordedUnconditionalPurchaseObligationBalanceOnFirstAnniversary\n",
      "UnrecordedUnconditionalPurchaseObligationBalanceSheetAmount\n",
      "ValuationAllowanceDeferredTaxAssetChangeInAmount\n",
      "ValuationAllowancesAndReservesBalance\n",
      "ValuationAllowancesAndReservesChargedToCostAndExpense\n",
      "ValuationAllowancesAndReservesDeductions\n",
      "VariableLeaseCost\n",
      "WeightedAverageNumberOfDilutedSharesOutstanding\n",
      "WeightedAverageNumberOfSharesCommonStockSubjectToRepurchaseOrCancellation\n",
      "WeightedAverageNumberOfSharesIssuedBasic\n",
      "WeightedAverageNumberOfSharesOutstandingBasic\n",
      "GoodwillOtherIncreaseDecrease\n",
      "CapitalizedContractCostAmortization\n",
      "CapitalizedContractCostImpairmentLoss\n",
      "EarlyRepaymentOfSeniorDebt\n",
      "ProceedsFromSaleOfOtherInvestments\n",
      "DeferredTaxAssetIntraEntityTransferAssetOtherThanInventory\n",
      "OtherNonoperatingIncome\n",
      "IncomeTaxExaminationInterestExpense\n",
      "DeferredTaxAssetsInProcessResearchAndDevelopment\n",
      "PaymentsOfDebtIssuanceCosts\n",
      "OtherIncome\n"
     ]
    }
   ],
   "source": [
    "from urllib.request import urlopen \n",
    "import urllib.request\n",
    "import urllib.error\n",
    "\n",
    "import json \n",
    "\n",
    "base_url = \"https://data.sec.gov/api/xbrl/companyfacts\"\n",
    "headers = {'User-Agent': 'Andreas Kollegger andreas.kollegger@neo4j.com'}\n",
    "\n",
    "def show_keys(dict):\n",
    "    for key in dict.keys():\n",
    "        print(key)\n",
    "\n",
    "def show_company_info(company):\n",
    "    print(f\"Entity Name: {company['entityName']}\")\n",
    "    print(f\"CIK: {company['cik']}\")\n",
    "\n",
    "for company in companies[0:1]:\n",
    "    if company['cik']:\n",
    "        company_cik = company['cik']\n",
    "        company_url = f\"{base_url}/CIK{company_cik.rjust(10,'0')}.json\"\n",
    "        company_request = urllib.request.Request(company_url, None, headers)\n",
    "\n",
    "        print(company_url)\n",
    "        try:\n",
    "            with urlopen(company_request) as response:\n",
    "                data = response.read()\n",
    "                data_json = json.loads(data) \n",
    "                # show_keys(data_json)\n",
    "                show_company_info(data_json)\n",
    "                show_keys(data_json['facts'])\n",
    "                show_keys(data_json['facts']['dei'])\n",
    "                show_keys(data_json['facts']['us-gaap'])\n",
    "        except urllib.error.HTTPError as e:\n",
    "            print(f\"HTTP Error: {e.code} {e.reason}\")\n",
    "        except urllib.error.URLError as e:\n",
    "            print(e.reason)\n",
    "        except Exception as e:\n",
    "            print(e)\n",
    "          \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a langchain vector store from the existing Neo4j knowledge graph.\n",
    "neo4j_vector_store = Neo4jVector.from_existing_graph(\n",
    "    embedding=OpenAIEmbeddings(),\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    node_label=VECTOR_NODE_LABEL,\n",
    "    text_node_properties=[VECTOR_SOURCE_PROPERTY],\n",
    "    embedding_node_property=VECTOR_EMBEDDING_PROPERTY,\n",
    ")\n",
    "\n",
    "# Create a retriever from the vector store\n",
    "retriever = neo4j_vector_store.as_retriever()\n",
    "\n",
    "# Create a chatbot Question & Answer chain from the retriever\n",
    "chain = RetrievalQAWithSourcesChain.from_chain_type(\n",
    "    ChatOpenAI(temperature=0), chain_type=\"stuff\", retriever=retriever\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "chain(f\"Where is Fedex headquartered?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "set_company_location_cypher = \"\"\"\n",
    "  MATCH (com:Company {cusip6: $cusip6})\n",
    "  SET com.companyAddress = $companyAddress\n",
    "  SET com.location = point({latitude: $latitude, longitude: $longitude})\n",
    "  MERGE (addr:Address {city: $city, state: $state} )\n",
    "   ON CREATE SET addr.country = $country\n",
    "  MERGE (com)-[:LOCATED_AT]->(addr)\n",
    "\"\"\"\n",
    "\n",
    "for company in companies:\n",
    "    result = chain(f\"Where is {company['companyName']} headquartered?\")\n",
    "    address_statement = result['answer']\n",
    "    address_geocodes = gmaps.geocode(address_statement)\n",
    "    if len(address_geocodes) > 0:\n",
    "        address_geocode = address_geocodes[0]\n",
    "\n",
    "        cusip6 = company['cusip6']\n",
    "\n",
    "        location = get_location(address_geocode)\n",
    "        city = get_city(address_geocode)\n",
    "        state = get_state(address_geocode)\n",
    "        postal = get_postalcode(address_geocode)\n",
    "        country = get_country(address_geocode)\n",
    "\n",
    "        cityOrState = city if city else state\n",
    "        stateOrCountry = state if state else country \n",
    "\n",
    "        print_address(company['companyName'], address_geocode['formatted_address'],\n",
    "            long_name(cityOrState), \n",
    "            long_name(stateOrCountry), \n",
    "            long_name(postal), \n",
    "            long_name(country)\n",
    "        )\n",
    "\n",
    "        if location and cityOrState and stateOrCountry:\n",
    "            kg.query(set_company_location_cypher, params={\n",
    "                \"companyAddress\": address_geocode['formatted_address'],\n",
    "                \"cusip6\": company['cusip6'],\n",
    "                \"latitude\": location['lat'],\n",
    "                \"longitude\": location['lng'],\n",
    "                \"city\": long_name(cityOrState),\n",
    "                \"state\": long_name(stateOrCountry),\n",
    "                \"country\": long_name(country)\n",
    "            })\n",
    "    else:\n",
    "        print(f\"no geocode found for {company['companyName']} at {address_statement}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Which state has the most public companies listed?\n",
    "kg.query(\"\"\"\n",
    "  MATCH p=(:Company)-[:LOCATED_AT]->(address:Address)\n",
    "  RETURN address.state as state, count(address.state) as numCompanies\n",
    "    ORDER BY numCompanies DESC\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Which city in California has the most companies listed?\n",
    "kg.query(\"\"\"\n",
    "  MATCH p=(:Company)-[:LOCATED_AT]->(address:Address)\n",
    "         WHERE address.state = 'California'\n",
    "  RETURN address.city as city, count(address.city) as numCompanies\n",
    "    ORDER BY numCompanies DESC\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "kg.query(\"\"\"\n",
    "  CALL db.index.fulltext.queryNodes(\"fullTextCompanyNames\", $companyName) \n",
    "    YIELD node, score\n",
    "  WITH node as com\n",
    "  RETURN com.location, com.companyAddress\n",
    "\"\"\", params={\"companyName\": \"Fedex\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Which investment firms are near Fedex?\n",
    "kg.query(\"\"\"\n",
    "  CALL db.index.fulltext.queryNodes(\"fullTextCompanyNames\", $companyName) \n",
    "         YIELD node, score\n",
    "  WITH node as com\n",
    "  MATCH (mgr:Manager)\n",
    "    WHERE point.distance(mgr.location, com.location) < $withinMeters\n",
    "  WITH mgr, \n",
    "    toInteger(point.distance(mgr.location, com.location) / 1000) as distanceKm\n",
    "  RETURN mgr.managerName, mgr.managerAddress, \n",
    "        apoc.number.format(distanceKm) + \"km\" as distance\n",
    "\n",
    "\"\"\", params={\"companyName\": \"Fedex\", \"withinMeters\": 100 * 1000})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "kg-query-patterns-fsqh8llA-py3.11",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
