{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": false,
    "jupyter": {
     "outputs_hidden": false
    }
   },
   "source": [
    "# Minimum Viable Graph (MVG)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In this notebook, you'll create the Minimumm Viable Graph consisting of `Chunk` nodes arranged into linked lists.\n",
    "\n",
    "\n",
    "1. Extract text from Form10k files, split into chunks, create `Chunk` nodes\n",
    "2. Enhance each `Chunk` node with a text embedding\n",
    "3. Expand the `Chunk` nodes with `NEXT` relationships to form linked lists\n",
    "\n",
    "```cypher\n",
    "(:Chunk \n",
    "  chunkId: string\n",
    "  chunkSeqId: int\n",
    "  cik: int\n",
    "  cusip6: string\n",
    "  f10kItem: string\n",
    "  source: string\n",
    "  text: string\n",
    "  textEmbedding: float[]\n",
    ")\n",
    "```\n",
    "\n",
    "```cypher\n",
    "(:Chunk)-[:NEXT]->(:Chunk)\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup\n",
    "\n",
    "Import some python packages, set up global constants, and create a connection to the Neo4j database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%run 'shared.ipynb'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Prepare a knowledge graph interface\n",
    "\n",
    "You will use the Langchain `Neo4jGraph` interface to send queries\n",
    "to the Neo4j Knowledge Graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a knowledge graph using Langchain's Neo4j integration.\n",
    "# This will be used for direct querying of the knowledge graph. \n",
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")\n",
    "kg.query(\"RETURN 'Hello, World!' AS message\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Form 10k pre-preprocessing\n",
    "\n",
    "The Form10k data you will be working with has been preprocessed from the original source. \n",
    "\n",
    "The Form 10K forms are complicated files.\n",
    "\n",
    "The pre-processing extracted useful text sections,\n",
    "then combined that with a mapping file \n",
    "that has extra metadata about the filing company.\n",
    "\n",
    "The preprocessing steps included:\n",
    "- downloading the original Form 10k files from the SEC website\n",
    "- extracting sections of text from the forms\n",
    "- storing the extracted text along with some metadata in a json file\n",
    "  - \"source\" - each json retains a URL for the original download source\"\n",
    "    For example:\n",
    "    ```\n",
    "    \"https://www.sec.gov/Archives/edgar/data/106040/000010604023000024/0000106040-23-000024-index.htm\"\n",
    "    ```\n",
    "- the metadata from the mapping file includes:\n",
    "  - \"cik\": a \"central index key\" for the company, defined by the SEC\n",
    "  - \"cusip6\": a cusip code identifies a financial instrumenet, like a stock,\n",
    "    issued by a particular company.\n",
    "    The first 6 characters of the \"cusip\" code are used to identify the company.\n",
    "    defined by Committee on Uniform Securities Identification Procedures.\n",
    "  - \"cusip\": the full 9-character cusip code extends the base cusip with specific\n",
    "    information about the financial instrument itself. \n",
    "    A single company will a single 6-character cusip code, but may have many\n",
    "    9-character cusip codes for different financial instruments.\n",
    "    For example: \n",
    "    ```\n",
    "    [\n",
    "        \"958102905\",\n",
    "        \"958102955\",\n",
    "        \"958102105\",\n",
    "        \"958102AM7\"\n",
    "    ]\n",
    "    ```\n",
    "  - \"names\": an array of known names for the company. \n",
    "    For example:\n",
    "    ```\n",
    "      [\n",
    "        \"WESTERN DIGITAL CORP\",\n",
    "        \"WESTERN DIGITAL CORP.\"\n",
    "    ]\n",
    "    ```\n",
    "  \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Step by step inspection of a single form 10k document"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Start with one file\n",
    "\n",
    "Get the the file name and then loading the json."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "first_file_name = [f\"{DATA_DIR}/form10k/\" + x for x in os.listdir(f\"{DATA_DIR}/form10k/\")][0]\n",
    "\n",
    "first_file_as_object = json.load(open(first_file_name))\n",
    "\n",
    "first_file_name"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Look at the available keys\n",
    "\n",
    "You can loop through they keys to check what the json contains.\n",
    "\n",
    "The first few keys, with names like \"item1\" are the text extracted from the form 10k.\n",
    "The names match the sections within the form.\n",
    "\n",
    "Then there are some fields that were pulled from the mapping file,\n",
    "including cik, cusip6, cusip and names.\n",
    "\n",
    "The source field contains a URL to the download page on the SEC website."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for k,v in first_file_as_object.items():\n",
    "    print(k, type(v))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Look at one of the items\n",
    "\n",
    "Take a look at one of the items to see what the text is like.\n",
    "This full text will be split into chunks and stored in the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "item1_text = first_file_as_object['item1']\n",
    "\n",
    "item1_text[0:1500]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Text splitter from Langchain\n",
    "\n",
    "You can use a text splitter function from Langchain.\n",
    "\n",
    "The `RecursiveCharacterTextSplitter` will use newlines\n",
    "and then whitespace characters to break down a text until\n",
    "the chunks are small enough. This strategy is generally\n",
    "good at keeping paragraphs together.\n",
    "\n",
    "Set a chunk size of 2000 characters,\n",
    "with 200 characters of overlap between each chunk,\n",
    "using the built-in `len` function to calculate the \n",
    "text length.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Splitting text into chunks using the RecursiveCharacterTextSplitter \n",
    "text_splitter = RecursiveCharacterTextSplitter(\n",
    "    chunk_size = 2000,\n",
    "    chunk_overlap  = 200,\n",
    "    length_function = len,\n",
    "    is_separator_regex = False,\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Text splitter demonstration\n",
    "\n",
    "You can see what the text splitter will do by splitting up\n",
    "the `item1_text`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "item1_text_chunks = text_splitter.split_text(item1_text)\n",
    "item1_text_chunks[0]\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Helper function for loading form 10k data\n",
    "\n",
    "You can create a helper function to load the form 10k data from the json files.\n",
    "\n",
    "This function will load the file as a json object, \n",
    "then for each text section in the json, it will split the text into chunks.\n",
    "For each chunk, it will create a new object with the chunk text and the metadata from the form 10k.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "jupyter": {
     "outputs_hidden": false
    }
   },
   "outputs": [],
   "source": [
    "def split_form10k_data_from_file(file):\n",
    "    chunks_with_metadata = [] # use this to accumlate chunk records\n",
    "    file_as_object = json.load(open(file)) # open the json file\n",
    "    for item in ['item1','item1a','item7','item7a']: # pull these keys from the json\n",
    "        print(f'Processing {item} from {file}') \n",
    "        item_text = file_as_object[item] # grab the text of the item\n",
    "        item_text_chunks = text_splitter.split_text(item_text) # split the text into chunks\n",
    "        chunk_seq_id = 0\n",
    "        for chunk in item_text_chunks[:20]: # only take the first 20 chunks\n",
    "            form_id = file[file.rindex('/') + 1:file.rindex('.')] # extract form id from file name\n",
    "            # finally, construct a record with metadata and the chunk text\n",
    "            chunks_with_metadata.append({\n",
    "                'text': chunk, \n",
    "                # metadata from looping...\n",
    "                'f10kItem': item,\n",
    "                'chunkSeqId': chunk_seq_id,\n",
    "                # constructed metadata...\n",
    "                'formId': f'{form_id}', # pulled from the filename\n",
    "                'chunkId': f'{form_id}-{item}-chunk{chunk_seq_id:04d}',\n",
    "                # metadata from file...\n",
    "                'names': file_as_object['names'],\n",
    "                'cik': file_as_object['cik'],\n",
    "                'cusip6': file_as_object['cusip6'],\n",
    "                'source': file_as_object['source'],\n",
    "            })\n",
    "            chunk_seq_id += 1\n",
    "        print(f'\\tSplit into {chunk_seq_id} chunks')\n",
    "    return chunks_with_metadata"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create a graph from the chunks\n",
    "\n",
    "You now have chunks prepared for creating a knowledge graph.\n",
    "\n",
    "The graph will have 1 node per chunk, containing the chunk text and metadata as properties."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Merge chunk query\n",
    "\n",
    "You will use a Cypher query to merge the chunks into the graph.\n",
    "\n",
    "This query accepts a query parameter called `chunkParam` which is expected\n",
    "to have the data record containing the chunk and metadata.\n",
    "\n",
    "The `MERGE` query will first match an existing node with the same `chunkId` property.\n",
    "\n",
    "If no such node exists, it will create a new node and the `ON CREATE` clause will set the properties using values from the `chunkParam` query parameter."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "merge_chunk_node_query = \"\"\"\n",
    "MERGE(mergedChunk:Chunk {chunkId: $chunkParam.chunkId})\n",
    "    ON CREATE SET \n",
    "        mergedChunk.names = $chunkParam.names,\n",
    "        mergedChunk.formId = $chunkParam.formId, \n",
    "        mergedChunk.cik = $chunkParam.cik, \n",
    "        mergedChunk.cusip6 = $chunkParam.cusip6, \n",
    "        mergedChunk.source = $chunkParam.source, \n",
    "        mergedChunk.f10kItem = $chunkParam.f10kItem, \n",
    "        mergedChunk.chunkSeqId = $chunkParam.chunkSeqId, \n",
    "        mergedChunk.text = $chunkParam.text\n",
    "RETURN mergedChunk\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Helper function to create nodes for all chunks.\n",
    "# This will use the `merge_chunk_node_query` to create a `:Chunk` node for each chunk.\n",
    "def create_nodes_for_all_chunks(chunks_with_metadata_list):\n",
    "    node_count = 0\n",
    "    for chunk in chunks_with_metadata_list:\n",
    "        print(f\"Creating `:Chunk` node for chunk ID {chunk['chunkId']}\")\n",
    "        kg.query(merge_chunk_node_query, \n",
    "                params={\n",
    "                    'chunkParam': chunk\n",
    "                })\n",
    "        node_count += 1\n",
    "    print(f\"Created {node_count} nodes\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Prepare unique constraint\n",
    "\n",
    "Before calling the helper function to create a knowledge graph,\n",
    "we will take one extra step to make sure we don't duplicate data.\n",
    "\n",
    "The uniqueness constraint is also index. It's job is to ensure that\n",
    "a particular property is unique for all nodes that share a common label.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a uniqueness constraint on the chunkId property of Chunk nodes \n",
    "kg.query(\"\"\"\n",
    "CREATE CONSTRAINT unique_chunk IF NOT EXISTS \n",
    "    FOR (c:Chunk) REQUIRE c.chunkId IS UNIQUE\n",
    "\"\"\")\n",
    "\n",
    "created_indexes = kg.query('SHOW CONSTRAINTS')\n",
    "print(created_indexes)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Load all form10 files\n",
    "\n",
    "Perform the node creation for all files in an import directory. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%time\n",
    "\n",
    "IMPORT_DATA_DIRECTORY = f\"{DATA_DIR}/form10k/\"\n",
    "\n",
    "all_file_names = [IMPORT_DATA_DIRECTORY + x for x in os.listdir(IMPORT_DATA_DIRECTORY)]\n",
    "counter = 0\n",
    "\n",
    "for file_name in all_file_names:\n",
    "    counter += 1\n",
    "    print(f'=== Processing {counter} of {len(all_file_names)} ===')\n",
    "    # get and split text data\n",
    "    print('Reading and splitting Form10k file...')\n",
    "    chunk_list = split_form10k_data_from_file(file_name)\n",
    "    #load nodes\n",
    "    print('Creating Chunk Nodes...')\n",
    "    create_nodes_for_all_chunks(chunk_list)\n",
    "    print(f'Done Processing {file_name}')\n",
    "\n",
    "# Check the number of nodes in the graph\n",
    "kg.query(\"MATCH (n:Chunk) RETURN count(n) as chunkCount\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Check the number of unique form IDs in the graph\n",
    "kg.query(\"MATCH (c:Chunk) RETURN count(distinct(c.formId)) as uniqueFormCount\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Check the number of unique company CUSIPs (company IDs) in the graph\n",
    "# Expect this to match the `uniqueCompanyCount` from the previous cell\n",
    "kg.query(\"MATCH (c:Chunk) RETURN count(distinct(c.cusip6)) as uniqueCompanyCount\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# See a list of the company names in the graph\n",
    "kg.query(\"MATCH (c:Chunk) RETURN DISTINCT c.names\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Enhance - vector embeddings for the text of each chunk  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup\n",
    "\n",
    "You will use the `embeddings_api` defined in `shared.ipynb` to get the vector embeddings \n",
    "for the text of each chunk. This api will use an LLM to calculate an embedding for text."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[-0.027151007848902352, -0.008134282386913065, -0.029120866899621442, -0.005224261556734908, 0.0019009837865725436, 0.01582775675029458, -0.027825995076727377, -0.017797615801013668, -0.023720970939666425, -0.005289693954072126, 0.00433231434810668, 0.010820455174362874, 0.010049041598843957, -0.007879439928166745, -0.010737803087874085, 0.014946140703231477, 0.004945312743895764, 0.013485964707359835, 0.0012371891937145844, -0.016902225492745466, 0.0045527183598724555, -0.000396038298570557, 0.009980164704882867, -0.0124321582880392, -0.01644764320800881, -0.019671049435361465, 0.013933659861493938, -0.03992065881953147, -0.006188528758964203, -0.02354189436812894, 0.019078713362702632, -0.0032044663853649895, -0.014601759958716412, -0.009801087202022784, -0.03468606703255403, -0.021806212659058133, 0.0038295181910311337, -0.009064111142161815, 0.02622806715557875, 0.01204645196594104, 0.014656860728827208, -0.007521283525462684, 0.004414965968934171, -0.0039603827528749205, -0.006212635578718325, 0.007163127588419921, 0.005182935979151812, -0.02099347350595612, -0.009263851899474745, 0.0009900956882187301, 0.03463096626244324, 0.027784668567821684, -0.010145467946537848, -0.011047746316731201, 0.005899248784559934, 0.02245364950182776, -0.0052380367492626066, -0.01613081098590395, 0.008306472759170598, 0.008437337553845034, -0.00736286834573285, 0.005802821971204745, -0.011963799879452251, 0.0049900823524414335, -0.011054634378656348, 0.001067581495433009, 0.00446662317374369, 0.008513101578408675, 0.004855773992465722, 0.009291402284530143, 0.01950574712502908, 0.010786016727382329, -0.011908699109341458, -0.01695732626285626, 0.012507922312602842, -0.0031424777861596962, -0.011578093557354091, 0.015676228701167298, 0.012645675169202425, 0.005227705587697482, 0.011640082389390034, -0.03936965111842352, 0.012018901580885644, 0.03104940130408003, 0.016819574337579274, -0.001777006588161957, 0.005975012343462277, 0.032234073449397695, -0.018073121514212837, -0.009346503985963534, 0.0034851369808547713, 0.013974986370399631, 0.0057683839898854975, 0.019560847895139875, -0.01571755521007299, 0.021310303865415787, -0.019698599820416864, 0.026076539106451465, -0.006567347950459812, -0.0184175022587279, 0.009263851899474745, 0.01639254057525282, -0.013479077576757285, -0.012996943975642637, -0.04038901722811842, -0.008451112746372733, 0.014312479052989546, 0.002548420396511523, 0.016640495903396592, 0.024437284676397147, -0.009022785564578719, 0.037138060615710365, -0.008795493490887795, -0.04711133725866808, -0.02219191991247889, -0.0072939923830943575, 0.02041491355714758, -0.034465663952110856, -0.021268977356510094, 0.004824779576447751, -0.003352550170699049, 0.04397058218648162, 0.007349093153205152, -0.0022419211986169814, 0.000522598345580087, 0.007769237922283857, 4.460811866259476e-05, -0.018927187176220543, -0.02421687973330877, 0.004487285962535238, 0.03289528641601762, 0.03339119334701478, 0.012631899976674727, -0.006353831534957886, -0.034272809394077876, 0.0349891231308086, -0.017659863875736682, 0.010400309473961571, -0.030085134101850736, -0.01703997741802245, 0.021558259193559557, 0.01233573194034531, 0.0055238731583656005, 0.004387415583878773, 0.005826928790958866, 0.013189796671030419, -0.001674553186283562, -0.013830346383197497, 0.02354189436812894, 0.001458454096805679, 0.003598782784869584, -0.014877264740592984, -0.010035265474993662, -0.002267749801021741, -0.01223930559265142, 0.02958922530820839, 0.008712842335721603, 0.021558259193559557, -0.011529879917845848, -0.007741687537228459, -0.0015634902890753553, 0.006956498769181844, 0.006340056342430187, 0.01826597420960062, 0.018954737561275938, 0.034300361641778465, 0.011047746316731201, -0.0062642927835278445, 0.0015850140856075467, -0.002128275394602169, -0.027867319722987876, 0.039782908756899674, -0.03383200323319152, 0.007493733140407286, -0.020786844686718042, 0.004294432801486158, -0.0019681381993910483, 0.01593795829051617, -0.005885473592032235, -0.02790864623189357, -0.04066452480396278, 0.0032853959907111928, -0.0032785083944473436, 0.034024854065934106, -0.03722071363352175, -0.018004244620251745, -0.0032664549845702827, -0.01972615020547226, 0.0065329099691405655, -0.00958757032085956, 0.007052925582537033, 0.03358404790504775, -0.0012810977945196108, 0.0052552559727528795, -0.6700279275470504, -0.011722733544556227, 0.027963747002004363, -0.024354633521230955, 0.014959915895759176, 0.009594458382784707, -0.02606276298260117, -0.011233711881516431, -0.03341874559471537, 0.021847539167963826, -0.014932365510703777, 0.011736508737083925, -0.009277627092002444, -0.016364990190197427, 0.024657687756840324, -0.013892334283910842, 0.020042980564931926, -0.025718382238086108, 0.004390859149180049, 0.002548420396511523, 0.0028325347901332295, -0.022343447961606172, 0.01982257748448875, 0.008416674299392187, -0.005093396762060472, 0.014057637525565823, -0.0017752846890959947, -0.01888586066731485, 0.00611965279632571, 0.0460644189012726, -0.02801884777211516, 0.022742929476232028, 0.004335758379069254, 0.005396452394653738, 0.049398028531492034, -0.021999065354445915, -0.02801884777211516, 0.01852770379894949, -0.01535939834170763, 0.02721988474286344, -0.01888586066731485, -0.036862556765156394, 0.019739926329322553, -0.01132325109860777, -0.023252612531079478, 0.023927599758904503, 0.022770479861287427, -0.017095078188133245, -0.0027240547997316286, -0.015772655980183785, -0.0018872085940448448, 0.02739896131440093, 1.3512923353320358e-05, 0.0005863088438513427, -0.017894043080030158, -0.007555721972443229, 0.0497837339222676, 0.005592749586665392, 0.014849714355537585, 0.013678818334070215, 0.009339615924038387, 0.00864396637308311, -0.02005675668878222, -0.027467838208362017, -0.005100284358324322, 0.007741687537228459, -0.005141610401568715, 0.041794092453879265, 0.011268150328496975, -0.012315068685892463, 0.005062402346042501, 0.01822464956334012, -0.028872913434122863, -0.006663774763815001, -0.001426598789462389, 0.04096757717692696, 0.01077224153485463, -0.020263385508020298, -0.018637907201816274, 0.027825995076727377, 0.018279750333450914, -0.01170207029010338, -0.02056644160627486, -0.019312892566996104, 0.026434695974816826, 0.011068409571184048, -0.037358463696153546, 0.01446400710211683, 0.020649092761441057, -0.010668927125235591, 0.004142904752358876, 0.006729207161152219, -0.025497979157642927, -0.013114033577789374, 0.015841531011499682, 0.0016220350901487237, 0.0032320167704203867, 0.035595231602027336, 0.029919831791518352, -0.005857922741315539, 0.0031820815810921542, 0.014395131139478335, -0.018803209512148658, 0.0010701642858242902, 0.02790864623189357, 0.005251811941790305, -0.011474779147735053, 0.01380968312874465, 0.02467146388069062, -0.029534124538097596, -0.012170428698690328, -0.023045985574486595, 0.005530760754629449, -0.011819159892250117, -0.004346090006295677, -0.02285313101645362, 0.017122628573188643, 0.014711961498938003, 0.03567788461983872, 0.0010804957966353888, 0.028377004640480517, 0.0020421799756427535, 0.0023366259964908835, -0.0008346937445428375, 0.0184175022587279, 0.015841531011499682, 0.0034851369808547713, -0.042097148552133826, -0.019781250975583056, 0.0017735627900300323, -0.02044246394220298, -0.00982863758707818, 0.025360225369720747, -0.015882857520405375, 0.006732651192114793, 0.029120866899621442, 0.03237182723731988, 0.0032475139784293723, 0.017232831976055428, -0.008230708734606957, -0.009904400680319225, -0.001799391392434792, 0.0019767475783055355, -0.016709372797357683, 0.0022040391863351605, -0.03482382082047621, -0.011956912748849701, -0.005176048382887963, -0.003822630361936635, 0.004235888000412789, 0.000124084824378167, -0.02048378858846348, -0.024919417346189195, 0.030085134101850736, 0.010338321573248226, -0.02245364950182776, -0.018031795005307143, -0.00585103514505169, -0.004559605956136305, 0.0036469961915471787, 0.016488967854269312, 0.011440340700754508, -0.01380968312874465, 0.0027033917781094314, 0.01389922234583599, -0.005279362792507001, -0.01950574712502908, 0.023720970939666425, -0.0014980578917381372, -0.019202691026774518, -0.018899636791165145, -0.012680112684860374, -0.005830372356260142, -0.011027083993600952, -0.01852770379894949, 0.02823925271520353, -0.02100724776716122, -0.020235835122964903, 0.002198873372721949, -0.005269031165280578, 0.01097198229216756, 0.013286223950046906, -0.0006861793971307942, -0.007383531134524399, 0.016433867084158515, 0.0038122989675408612, -0.008891920769904284, 0.024630137371784926, 0.004504505186025511, -0.012831640733987655, 0.0014231549913304642, 0.01435380556189524, -0.004018927553948289, 0.028432105410591314, 0.006977161557973392, -0.0022866905743320017, 0.002491597378088792, 0.021406731144432273, 0.04308896613941852, 0.0239827005290153, 0.006408932770729979, -0.0021747667857984765, 0.01252169750513054, -0.013093370323336528, 0.005944018393105603, -0.02227457106764508, 0.0018665456888379722, -0.008857482322923738, 0.024437284676397147, 0.014036974271112976, 0.019354219075901798, -0.01851392953774439, 0.013974986370399631, 0.006012894355744097, 0.015097668752358758, 0.020897046226939633, -0.009973277574280315, 0.015331847956652234, 0.0008019775458742285, -0.02446483506145254, -0.007597047550026325, 0.00557553036317512, 0.018431278382578197, -0.014849714355537585, 0.014835939163009888, -0.0011493719921045315, 0.012135991183032381, 0.026696425564165696, -0.0016151474938848746, -0.03292283493842783, 0.01088244307507622, -0.00496597599834861, -0.00442185356519802, 0.009318953600908137, 0.014987466280814573, -0.012012013518960496, 0.007776125984209004, 0.0059853439706887, 0.03708295984559957, 0.0072802167249053605, 0.0029565119885438165, 0.02420310547210367, 0.03934209887072293, -0.013699480657200464, -0.0004692192708084366, 0.031021850919024634, 0.04333692146756229, -0.0015901797828054337, 0.0016073988898803817, -0.014849714355537585, -0.02695815515351457, 0.005269031165280578, -0.012996943975642637, 0.013485964707359835, 0.03234427498961929, -0.019202691026774518, -0.011102847086841996, 0.009394716694149182, 0.013306886273177157, 0.022439873377977464, 0.027963747002004363, -0.00016541056203233436, -0.008175607964496161, 0.017191505467149735, 0.010489848691052912, -0.01519409510005265, -0.006949611172917995, -0.009270739961399892, -0.012852303988440502, -0.01040719753588672, -0.019409319846012595, 0.009139875166725457, 0.01233573194034531, -0.011550543172298694, 0.0062470735600375716, 0.016075710215793158, -0.00585103514505169, 0.01050362388358061, 0.002092115397801635, 0.017370583901332413, -0.01961594866525067, -0.03697275830537798, 0.033721797967679545, -0.009711547984931445, -0.013327549527630001, -0.012005126388357944, -0.034024854065934106, 0.007252666339849963, -0.015662452577317004, 0.017811391924863966, 0.020042980564931926, 0.009938839127299771, 0.036421746878979644, 0.00294790237679868, 0.017701190384642376, 0.013279335888121758, 0.029423922997876006, -0.02369342055461103, 0.005944018393105603, -0.01811444802311853, -0.003042607174672582, 0.004142904752358876, -0.013389538359665944, 0.0007546251469372774, 0.019381769460957196, -0.010786016727382329, 0.003352550170699049, -0.015276746255218842, -0.007755462729756159, -0.001581570287475622, -0.0002892801490272561, 0.0026569003869131237, -0.012287518300837066, 0.0013275891857159185, 0.017907819203880453, 0.013568615862526027, -0.0006074021947208747, -0.013981873501002181, 0.014643085536299508, 0.004153236379585299, 0.0035505693781919894, -0.02278425598513772, -0.023900049373849108, 0.019161366380514015, 0.05083065227966309, -0.0021971515900713113, 0.00117606148583461, 0.015593577546001106, 0.005138166370606142, -0.0001238695869949217, -0.021489382299598465, -0.023390366319001658, 0.0035299065894004414, -0.005282806357808276, -0.021668460733781144, 0.004253106758241763, 0.026847951750647785, -0.000459318322075322, 0.02125520309530499, -0.017770065415958273, -0.0010658595963670466, -0.012645675169202425, -0.009821749525153033, -0.015579802353473407, -0.012135991183032381, 0.0052380367492626066, -0.01131636396800522, 0.015483375074456919, 0.015276746255218842, -0.02369342055461103, 0.032206521201697105, 0.027454063947156916, 0.0008811851939468074, -0.022508750271938556, 0.01613081098590395, 0.0021833763975436125, 0.012053339096543592, 0.01529052144774654, -0.024148004701992878, 0.015634902192261605, -0.002362454598895643, 0.005055514749778651, 0.024878092699928696, 0.005424002779709136, 0.007968979145258084, 0.03289528641601762, 0.0008807547482841481, 0.005389564798389889, 0.007321542768149754, -0.0156486783161119, -0.009126099974197758, 0.015579802353473407, -0.0065742355467236615, -0.016819574337579274, 0.0202771597692254, -0.011584980687956643, -0.008554427155991771, -0.015965508675571567, -0.004080916385984231, 0.00801030472284118, -0.020538889358574272, 0.00975287356251454, -0.015469599881929221, -0.03071879668341526, -0.008988347117598175, -0.019877678254599542, 0.005410227587181437, -0.02983718063635216, -0.0008303889968779316, -0.009911288742244374, -0.014160951935184862, 0.02511227190422217, -0.011288813582949822, -0.014574209573661016, 0.006450258348313075, -0.00745240756282419, -0.038680889629393395, -0.0076245979350817224, -0.000799394697275285, 0.01720528159100003, 0.0059853439706887, -0.019312892566996104, 0.004893655539086245, -0.020607766252535364, 0.011956912748849701, -0.005182935979151812, -0.0033887101674995824, -0.037689068316818314, -0.02845965579564671, 0.007617710338817873, 8.145421099756975e-06, 0.002124831596470244, -0.009022785564578719, 0.0038949505883683518, 0.03468606703255403, 0.007851889543111348, 0.003025388184012959, -0.011440340700754508, 0.02176488615015244, 0.005892361188296084, 0.01735680777748212, 0.0050658463770050744, 0.018059345390362542, -0.031132054321891416, -0.0069874931851998156, -0.026462246359872224, 0.011419678377624259, -0.0004132573474378426, 0.019671049435361465, 0.0038191865638047104, 0.0001657334108312445, 0.032977935708538623, -0.011860485469833213, -0.006904841564372325, 0.008106732001857669, 0.015345623149179932, -0.009739098369986841, -0.008320247951698296, -0.0028841919949427488, -0.011095959956239444, -0.0036779903747345007, 0.026723975949221095, 0.016282339035031235, -0.00400515236142059, 0.007707249555909213, -0.02512604616542727, 0.004872992750294697, 0.02972697909613057, -0.0042048935843948185, 0.014656860728827208, -0.0028463099826609283, 0.0017735627900300323, 0.01703997741802245, -0.013671930272145066, -0.001983635174569385, 0.026145414137767362, -0.024643913495635224, -0.026255617540634147, -0.040747174096483776, -0.009911288742244374, -0.0349340223606978, 0.0017632313956342583, -0.00809295680932997, 0.012480371927547444, -0.019299118305791004, 0.0017597875975023337, 0.0037881923806173884, -0.04096757717692696, -0.0034696397728457857, -0.03049839174032689, 0.0018992618875065812, 0.018293524594656014, 0.02659999828514921, 0.022990882941730607, 0.0008067127974094561, 0.00019844962405176907, -0.018334851103561707, -0.0239413758827548, 0.00982863758707818, -0.03385955175560172, -0.029258620687543622, 0.0005424002430463162, 0.030305539044939107, 0.0068187463782435585, 0.03719316138582116, -0.0010865225015739193, 0.0184175022587279, 0.005351682786108068, -0.00672231956488837, 0.00400515236142059, 0.0070494815515744595, -0.02059399199133026, -0.013052044745753432, 0.009174312682383405, 0.00028260774649090526, 0.020042980564931926, 0.006619005155269331, -0.009532469550748764, -0.01115106072635024, 0.002775711771710499, -0.023376590195151363, 0.019932779024710336, -0.01695732626285626, 0.004687027185509465, -0.0014808387846631894, -0.008065405492951976, -0.011784722376592168, -0.0004920345498477621, -0.0175083358266094, 0.000372792573868572, 0.02961677755590898, 0.021806212659058133, 0.02421687973330877, -0.011695183159500829, -0.0007808841950046964, -0.022370998346661567, 0.019312892566996104, 0.022467423763032863, 0.008402899106864488, -0.016888449368895168, -0.0024106677727425887, -0.011295700713552374, 0.01290051669662615, 0.02994738217657375, 0.021048574276066913, 0.00041648592273843755, 0.0021368847735166556, 0.004363308764124651, -0.006291843168583241, 0.017880268818825054, 0.0004205754475720137, 0.0030081691933533357, 0.007424857177768793, -0.018279750333450914, -0.02478166542091221, -0.010035265474993662, -0.017646089614531582, -0.028377004640480517, -0.012893629566023598, 0.01537317353423533, -0.017191505467149735, 0.010586275970069399, -0.010834230366890572, -0.02708213095494126, -0.02693060476845917, -0.011839823146702963, 0.0488470171050937, 0.0024261649807515743, -0.006202303951491902, 0.011729620675158777, -0.007156239526494773, -0.00012322387484518582, 0.022729153352381733, 0.0026775631757046717, -0.00588891715733351, 0.026145414137767362, 0.03047084135527149, 0.008974571925070476, -0.001875155184167784, -0.013768357551161554, 0.013727031973578458, -0.009015897502653572, -0.026296942186894646, 0.028129049312336746, 0.009518694358221065, -0.01417472712771256, -0.031021850919024634, -0.01811444802311853, -0.02201284147829621, 0.0029754529946847265, -0.022742929476232028, 1.8671913937117502e-05, -0.0018889304931108072, -0.0009918175872846925, -0.0432267199273407, 0.013665043141542516, -0.0010804957966353888, 0.002427886996232861, 0.004087803982248081, -0.0001231162488776054, -0.0037744171880896896, -0.0006362441495948995, -0.006560460354195963, 0.013224235118010963, 0.014071412718093522, 0.046753180390302726, -0.0005863088438513427, 0.00846488793890043, 0.016172137494809644, 0.016833348598784374, -0.006935835980390296, -0.00221092678259901, 0.0003323277711954702, 0.01913381599545862, -0.013231123179936112, 0.0007098555965992698, 0.019381769460957196, -0.0019974105999277327, 0.013313774335102304, -0.004084359951285507, -0.005279362792507001, -0.0024778221855610936, -0.015538475844567714, -0.002524313576757401, 0.015455824689401522, -0.0012242748925122046, -0.013644379887089669, -0.0032027443698837026, -0.009966389512355168, -0.005995675132253825, -0.00866462869621336, -0.012728326324368617, -0.018637907201816274, -0.016971102386706554, -0.0010159242906234898, 0.006054219933327193, 0.020580215867479965, 0.016488967854269312, 0.01691600161659576, -0.0007912156476081328, 0.00866462869621336, 0.01888586066731485, -0.014849714355537585, 0.009236301514419348, -0.0020249609849831303, -0.0029892281872124253, -0.013293111080649457, -0.012301293493364765, 0.019712375944267158, -0.016241014388770732, -0.001631505593219179, -0.014160951935184862, -0.00993195199669722, 0.006605229962741633, -0.02107612466112231, 0.014147176742657162, -0.008898807900506834, -0.004428741161461869, 0.015524700652040015, 0.0039190571752918246, -0.000615581244388027, -0.01954707177128958, -0.0257734830081969, 0.020153183967798707, 0.004959088402084761, 0.003650439989679103, 0.006436483155785376, -0.007021931166519062, 0.0062849555723193925, 0.008912583093034533, -0.0036883217691302747, 0.03358404790504775, -0.013589279116978874, -0.009938839127299771, 0.0063435003733927605, 0.015579802353473407, 0.006129983957890835, -0.03179326356322095, -0.037413564466264336, -0.0032251291741565375, -0.006470921137104623, 0.011419678377624259, -0.018004244620251745, 0.0033869883848489444, -0.014216052705295657, 0.007211340762266867, 0.0007132993947311945, 0.0018872085940448448, -0.009015897502653572, -0.024106678193087185, -0.022370998346661567, -0.01380968312874465, -0.016792023952523875, -0.02708213095494126, -0.016351215928992323, 0.021682234994986248, 0.0096633343454232, -0.029203519917432825, -0.019698599820416864, -0.0007520422983383339, -0.030112686349551325, -0.014436456717061431, -0.011998238326432797, -0.008099843939932521, 0.02005675668878222, 0.007493733140407286, 0.018445052643783297, 0.03074634706847066, -0.003120092981886861, 0.019244017535680207, -0.032454476529840875, -0.0010589720001031972, 0.01095820709963986, -0.025305124599609954, -0.014422681524533734, -0.011584980687956643, -0.011178611111405636, 0.007376643538260549, 0.012576798275241335, -0.005678844772794158, 0.009780423947569937, 0.04220735009235542, 0.001578987497084341, -0.004821335545485177, 0.009670222407348349, -0.005389564798389889, -0.012377057517928405, -0.0016530293897513704, 0.003168306388564456, -0.007748575133492309, -0.005534204785592024, -0.00937405437101893, 0.02790864623189357, -0.00043478117307386527, -0.0029186299762619956, -0.007679699170853815, 0.01575887985633349, 0.024878092699928696, -0.012356394263475559, 0.013864783898855445, -0.02733008628308503, -0.011219936688988732, 0.030525942125382288, 0.0023435135927547326, -0.036421746878979644, 0.030030033331739942, -0.014643085536299508, -0.0019595285876459123, 0.007080475967592431, 0.0239551501439599, 0.0012104996999845058, -0.019367995199752092, 0.016061935954588054, -0.027812218952877082, -0.03173816279311016, -0.003414538769904342, 0.0044941735587990875, -0.016544068624380105, 0.003660771384074877, 0.002631071784508364, -0.004191118391867119, -0.00565818198400261, 0.0027447175885231766, 0.016103260600848553, -0.00764526072387327, -0.008223821604004405, -0.014698186306410304, 0.018321074979711412, -0.0057683839898854975, -0.016709372797357683, -0.01427115347540645, 0.020607766252535364, 0.0025174259804935516, 0.0062436299947362965, -0.005451553164764533, -0.02431330701232526, 0.020249609384170003, -0.0021127781865931832, -0.004418409999896744, 0.03176571504081075, 0.22062431798866886, -0.030057583716795337, 0.0030959863949633886, 0.0267101998253708, -0.0020852278015377856, 0.007597047550026325, 0.017907819203880453, -0.0028979671874704476, -0.021503156560803566, -0.006278067976055543, 0.010290107933739983, 0.012535472697658239, -0.0013000386842451964, -0.007025374731820338, 0.002083505786056499, -0.02110367504617771, -0.019602174404045568, -0.012645675169202425, -0.04069207332637298, -0.019932779024710336, 0.0055824179594389685, -0.005981899939726126, -0.018045571129157438, -0.0165578447482304, 0.014946140703231477, 0.00611965279632571, -0.005596193151966668, 0.0060197819520079465, 0.016213464003715337, 0.05267653739160068, -0.015304297571596836, -0.005816597163732443, 0.02845965579564671, 0.004804116787656203, -0.00445973557747984, 0.003447254968572951, 0.01951952138623418, 0.0012974558938539152, 0.037937023644962084, 0.02540155187862644, 0.02558063031280912, 0.0028445879671796415, 0.012838527864590207, 0.0067980835894520105, -0.013789019874291803, 0.02219191991247889, 0.008113619132460219, -0.019354219075901798, -0.01925779179688531, 0.009401604756074329, -0.013286223950046906, 0.012693887877388073, 0.023349039810095965, 0.014546658257283022, 0.008106732001857669, -0.00017628008626601054, 0.012762764771349163, 0.024051577422976388, -0.015015016665869971, 0.013961211177871932, 0.006505359584085168, 0.03518197396355118, 0.005534204785592024, -0.011619419134937189, -0.011708958352028528, 0.007032262328084187, -0.008547539094066622, -0.027054580569885862, -0.003102873991227238, -0.017714964645847476, 0.012377057517928405, -0.009463593588110272, -0.005554867574383572, -0.0147257366914657, -0.030140236734606723, -0.030195337504717517, 0.002569083185303071, 0.030828998223636852, 0.009194975936836252, 0.035347279999173954, -0.018968511822481042, -0.019739926329322553, -0.004022371584910863, -0.03344629411712557, -0.009353391116566084, -0.05609279631434111, -0.0005677983997884163, -0.002026683000464417, 0.0004416687984415458, 0.0007451546438668222, -0.0073353179606774534, -0.014298703860461849, 0.0010538061864899858, 0.0016900503942925476, -0.013120920708391926, 0.007955203952730385, -0.0030494947709364317, 0.03160041273047837, -0.012370170387325855, -0.011853598339230663, -0.006374494789410732, -0.013582391055053726, 0.023390366319001658, -0.014071412718093522, -0.004731796794055136, 0.006147203181381107, -0.013575503924451176, -0.0019302561871092278, 0.012459708673094597, -0.003681434172866425, -0.0016306445854785355, -0.02230212145270048, 0.008809268683415495, -0.01759098698177559, -0.010827342304965425, 0.014863489548065285, 0.032454476529840875, -0.01097198229216756, 0.010903106329529066, -0.0011442062949066445, -0.02693060476845917, -0.015042567050925368, 0.006563904385158537, -0.01615836323360454, -0.002372785993291417, 0.002753326967437664, -0.025869910287213388, 0.007948315890805238, 5.171097777554165e-05, 0.00024364964915626729, 0.009504919165693368, 0.007473070351615738, 0.0020697305935288, 0.00764526072387327, -0.012466596735019746, 0.022150593403573195, -0.0018441608845651374, -0.0015781264893436973, 0.011295700713552374, 0.004356421167860802, -0.01877565912709326, -0.000544983149852922, 0.0033732131923212456, -0.022481199886883158, -0.013003831106245188, -0.042290003110166806, 0.0005294860000515986, -0.0031665843730831686, 0.00520359876794336, -0.016709372797357683, -0.03523707473366198, 0.006977161557973392, -0.0076245979350817224, -0.005740833139168802, -0.001777006588161957, -0.019244017535680207, -0.015276746255218842, -0.04408078372670321, 0.005606524779193091, 0.010021490282465963, -0.02383117434253321, 0.020373587048241888, 0.0025002069898339284, -0.022866907140303913, -0.005282806357808276, -0.01819709917828472, -0.17984959909506526, -0.0013336158906544489, 4.51731186126031e-05, -0.02724743512791884, 0.009029672695181271, -0.02726120938912394, 0.014822163970482189, 0.01794914385014095, -0.023197511760968684, -0.00524148078022518, -9.109956806656472e-05, 0.010448523113469816, -0.041105330964849134, -0.024437284676397147, 0.004903987166312668, 0.03058104289549308, -0.0068221899435448345, -0.01851392953774439, 0.021172551940138798, 0.004287545205222308, 0.03744111671396493, -0.03410750708374549, 0.024175555087048273, -0.007121801545175527, -0.01299005591371749, -0.0029892281872124253, 0.013451526260379291, 0.03774417281221949, 0.00014356388759740156, 0.0012001681891734073, -0.032454476529840875, 0.0027825993679743482, 0.014202277512767958, -0.014959915895759176, 0.012218642338198573, 0.008127394324987918, 0.02033226240198139, -0.015524700652040015, -0.011233711881516431, 0.024547486216618734, 0.008823044807265791, 0.02980963025129676, -0.0062642927835278445, 0.010455411175394964, 0.007576384761234777, 0.014670635921354907, 0.01372014391165331, -0.015414499111818426, 0.029754529481185968, -0.0023813953722059042, 0.005671957176530309, -0.016723147058562784, 0.010841117497493124, 0.003350828388048411, -0.009139875166725457, 0.011171723980803086, 0.013981873501002181, 0.01717773120594463, -0.00717690278094762, 0.011826047954175266, -0.0059991191632163985, -0.033969753295823316, 0.01050362388358061, -0.017150180820889233, -0.029396372612820607, -0.013871671960780593, -0.037413564466264336, 0.01592418402931107, -0.0033973197792447184, 0.012921179951078996, -0.004294432801486158, -0.00524148078022518, 0.006835965136072533, -0.016943552001651156, 0.0138165702593472, 0.002111056171111896, -0.03160041273047837, 0.024506161570358235, 0.018872086406109746, 0.007941428760202688, -0.014946140703231477, 0.015345623149179932, 0.0124459334805669, 0.016351215928992323, -0.0006741260454613955, 0.008416674299392187, -0.007170015184683771, 0.006233298367509873, -0.013052044745753432, 0.005913023977087633, 0.034520764722221646, -0.027949972740799262, 0.002927239588007132, -0.014835939163009888, 0.015497150266984618, 0.016971102386706554, 0.017384360025182708, 0.010737803087874085, -0.0004468344956394328, -0.0023882832013004027, 0.0022832467762000774, -0.017081303926928144, 0.00479378516042978, 0.018706782233132168, 0.02604898872139607, -0.007734799940964611, -0.008988347117598175, 0.008334023144225995, 0.033721797967679545, -0.013912997538363689, 0.0006005145984570254, 0.01629611515888153, 0.007500620736671136, 0.011633194327464886, -0.0037881923806173884, -0.001594484588678002, -0.004408078372670321, -0.026296942186894646, 0.008168719902571014, -0.011419678377624259, 0.03330854405449377, 0.012321956747817612, -0.017370583901332413, 0.025015844625205685, -0.008912583093034533, -0.038212531220806444, -0.08711464909601094, -0.022178143788628594, 0.009250076706947045, 0.004707689974301013, -0.011433453570151957, 0.006240185963773722, 0.010097254307029605, 0.03060859514319367, -0.009580683190257008, 0.020869495841884234, -0.005138166370606142, -0.03548503006180575, -0.01270077593931322, -0.002860085175188627, 0.016819574337579274, 0.0046594768004540685, -0.001679718883481449, 0.006360719131221735, -0.00836846159120654, 0.023720970939666425, -0.00865774156561081, -0.021406731144432273, 0.027963747002004363, -0.01721905585220513, -0.008086068747404822, 0.0047765664026008054, -0.027936196616948968, 0.024340857397380657, 0.010579387908144252, -0.0073146551718859055, 0.014629310343771811, -0.0021919857764580997, 0.005551423543420998, -0.008561314286594322, -0.0055204295930643245, -0.002941014780534831, -0.01640631669910312, 0.009236301514419348, 0.018899636791165145, -0.03441056318200006, -0.0009582404972907646, -0.012005126388357944, -0.012397720772381252, -0.0174945615654043, -0.0047765664026008054, 0.0018631018907060476, -0.0014240159990711076, 0.013974986370399631, -0.00643992718674795, -0.014891039933120681, -0.04251040619060998, 0.0060404447407994945, -0.01997410553361603, 0.004669807962019193, 0.02961677755590898, 0.0005441222003199408, 0.006705100341398098, -0.002589745974094619, -0.02048378858846348, 0.0006771393979306607, 0.01122682475091388, -0.023624545523295133, -0.024148004701992878, 0.016571619009435504, 0.006856628390525379, 0.005475659984518655, -0.012129103121107232, -0.005637519195211062, -0.004087803982248081, 0.012804090348932259, -0.01666804628845199, 0.026944379029664275, -0.008891920769904284, 0.019960329409765734, -0.0018493265817630244, -0.0055238731583656005, -0.008382236783734238, -0.04038901722811842, 0.014098963103148919, 0.006067995591516191, -0.01537317353423533, -0.021021023891011518, -0.0020766181897926496, 0.0036228893717930566, 0.0013232844962586749, 0.02361076939944484, -0.0039397199640833725, 0.013603054309506573, -0.004666364396717917, -0.034520764722221646, -0.0004950478441093651, 0.019602174404045568, 0.004098135143813205, -0.020222058999114605, -0.024051577422976388, 0.0028032623895965455, -0.02544287652488694, 0.007307767575622056, 0.009718435115533995, -0.006433039590484101, -0.026558671776243516, -0.015028791858397669, -0.06887622340882052, 0.01797669423519635, -0.00017412771243355762, -0.017811391924863966, -0.011185499173330784, -0.022357222222811272, -0.0075419467799155305, -0.020580215867479965, 0.00013893626202975443, 0.014202277512767958, -0.019120039871608322, -0.00413257359079375, -0.011047746316731201, 0.013479077576757285, -0.017053753541872746, -0.01885831028225945, 0.017012427032967053, -0.012563023082713636, 0.013396425490268496, 0.02173733576509704, 0.006746426384642491, -0.010014603151863413, 0.0005975012459877601, 0.01490481512564838, 0.004900543601011392, 0.018954737561275938, -0.023335265548890864, 0.02198529109324081, -0.00496597599834861, -0.011481666278337604, -0.017232831976055428, -0.027743343921561185, 0.001516137890138404, 0.01724660623726053, -0.0031820815810921542, 0.00111493389436996, 0.006894509937145902, 0.018927187176220543, 0.0193266686908464, 0.012776539963876862, -0.010076591983899354, -0.016516518239324707, 0.015318072764124535, -0.016488967854269312, 0.003342218776303275, 0.006946167141955421, -0.020828171195623735, -0.003168306388564456, 0.037386015943854135, -0.002284968791681364, 0.035071772423329595, 0.018059345390362542, -0.021048574276066913, -0.007232003551058415, 0.0014644806853288848, -0.028845363049067468, 0.02755048936352821, 0.006212635578718325, 0.022136819142368095, -0.00681185878197971, 0.04350222377789467, -0.007355980749469001, -0.0036366645643207554, -0.01400942388605758, -0.015579802353473407, -0.014422681524533734, -0.00736286834573285, -0.011908699109341458, 0.01344463912977674, -0.02191641419927972, -0.015896631781610476, 0.004077472355021657, -0.013706368719125612, 0.01703997741802245, -0.002930683386139057, 0.013258673564991509, 0.007142464333967075, 0.003157974994168682, -0.03071879668341526, 0.032482028777541465, 0.006150646746682383, -0.010786016727382329, -0.004321983186541555, 0.025222473444443762, 0.005551423543420998, 0.016544068624380105, 0.0037778609862216144, 0.0011958634997161638, 0.003750310368335568, 0.01573132947127809, -0.04532055664213167, -0.0013792463905254377, -0.015772655980183785, -0.004897099570048818, -0.00958757032085956, -0.016805798213728976, -0.007762350326020007, 0.009194975936836252, -2.4295012402274117e-05, 0.013775244681764104, 0.01706752780307785, 0.005492878742347629, -0.01020745677857379, -0.03204121889136472, -0.018293524594656014, 0.007893215120694444, -0.03700030682778818, -0.026365819080855734, 0.0257597087469918, 0.022054167987201903, 0.001170895788636723, -0.043667526088227056, 0.008175607964496161, 0.018569030307855183, -0.020001655918671427, -0.002892801373857236, -0.007397306327052097, -0.022467423763032863, -0.02460258698672953, 0.032151420431586315, 0.018651681463021375, 0.0012965948861132718, 0.02147560617574817, 0.001809722786830566, -0.0010658595963670466, -0.005744277170131376, -0.010131692754010149, -0.01491859031817608, 0.01885831028225945, -0.004480398366271388, 0.0032371825840335983, -0.011764059122139323, -0.01197757507197995, -0.014064524656168373, -0.00668443755260655, 0.01604815983073776, -0.010827342304965425, 0.024299532751120158, 0.011095959956239444, 0.07333940441424683, 0.006646555540324729, -0.020387363172092183, 0.028872913434122863, -0.007059813178800883, 0.013727031973578458, 0.01088244307507622, -0.0008695623461477305, 0.0052965815503359754, 0.012673225554257823, 0.013919884668966239, 0.00717690278094762, 0.01994655514856063, -0.021585809578614952, -0.023638319784500234, -0.014436456717061431, 0.004294432801486158, 0.029313721457654415, -0.02358321901438944, -0.008588865602972316, 0.02664132293140971, 0.01086866788254852, 0.017425684671443207, 0.0015290521913407839, -0.015028791858397669, 0.007080475967592431, 0.04584401582082942, -0.02336281593394626, -0.025415326139831544, -0.024409734291341748, -0.003328443583775576, -0.004232443969450215, -0.018445052643783297, -0.015896631781610476, -0.0039948211998554655, -0.006749869949943767, 0.008940134409412527, 0.001496335992672175, 0.0012802367867789674, 0.010593163100671951, -0.02595256144237958, -0.005558311139684847, -0.02100724776716122, -0.010827342304965425, 0.021833763044113528, -0.00044339069750750807, 0.0010374480871556812, 0.004618150757209674, -0.03807477743288426]\n",
      "Text embeddings will have 1536 dimensions\n"
     ]
    }
   ],
   "source": [
    "# A simple example of how to use the embeddings API\n",
    "text_embedding = embeddings_api.embed_query(\"embed this text using an LLM\")\n",
    "\n",
    "print(text_embedding)\n",
    "\n",
    "# all embeddings will have the same size, which is the dimensions of the vector\n",
    "vector_dimensions = len(text_embedding) \n",
    "\n",
    "print(f\"Text embeddings will have {vector_dimensions} dimensions\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Prepare a vector index\n",
    "\n",
    "Now that you have a graph populated with `Chunk` nodes, \n",
    "you can add vector embeddings.\n",
    "\n",
    "First, prepare a vector index to store the embeddings.\n",
    "\n",
    "The index will be called `form_10k_chunks` and will store\n",
    "embeddings for nodes labeled as `Chunk` in a property\n",
    "called `textEmbedding`.\n",
    "\n",
    "The embeddings index will match the dimensions of the \n",
    "embeddings returned by the `embeddings_api` and will use \n",
    "the cosine similarity function."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a vector index called \"form_10k_chunks\" the `textEmbedding`` property of nodes labeled `Chunk`. \n",
    "# neo4j_create_vector_index(kg, VECTOR_INDEX_NAME, 'Chunk', 'textEmbedding')\n",
    "kg.query(\"\"\"\n",
    "         CREATE VECTOR INDEX `form_10k_chunks` IF NOT EXISTS\n",
    "          FOR (c:Chunk) ON (c.textEmbedding) \n",
    "          OPTIONS { indexConfig: {\n",
    "            `vector.dimensions`: $vectorDimensions,\n",
    "            `vector.similarity_function`: 'cosine'    \n",
    "         }}\n",
    "\"\"\",\n",
    "params={'vectorDimensions': vector_dimensions})\n",
    "\n",
    "# Check the vector indexes in the graph\n",
    "kg.query('SHOW VECTOR INDEXES')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create text embeddings\n",
    "\n",
    "Creating the text embeddings will be a two step process. \n",
    "\n",
    "First, collect all chunk text and chunk ids from the graph.\n",
    "Yes these are the same chunk ids that were used to create the graph\n",
    "and you could save time by doing this all at once. We're doing\n",
    "this incrementally to show the process, not optimized for speed.\n",
    "\n",
    "Next, use the `embeddings_api` to get the embeddings for the text\n",
    "and write those values back into the graph. \n",
    "\n",
    "This will take some time to run as we're doing it one chunk at a time,\n",
    "calling out to the `embeddings_api` for each then writing all those\n",
    "results back into the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create vector embeddings for all the Chunk text, in batches.\n",
    "# Use this for larger number of chunks so that the query\n",
    "# can be re-run without losing all progress\n",
    "print(\"Creating vector embeddings for all chunks...\")\n",
    "all_chunk_text_id = kg.query(\"\"\"\n",
    "  MATCH (chunk:Chunk) WHERE chunk.textEmbedding IS NULL\n",
    "  RETURN chunk.text AS text, chunk.chunkId AS chunkId\n",
    "  \"\"\")\n",
    "\n",
    "print(\"Writing vector embeddings into the graph...\")\n",
    "for chunk_text_id in all_chunk_text_id:\n",
    "  text_embedding = embeddings_api.embed_query(chunk_text_id['text'])\n",
    "  kg.query(\"\"\"\n",
    "    MATCH (chunk:Chunk {chunkId: $chunkId})\n",
    "    CALL db.create.setNodeVectorProperty(chunk, \"textEmbedding\", $textEmbedding)    \n",
    "    \"\"\", \n",
    "    params={\"chunkId\":chunk_text_id['chunkId'], \"textEmbedding\":text_embedding} \n",
    "  )\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Expand - connect the chunks into linked lists\n",
    "\n",
    "You can now create relationships between all\n",
    "nodes in that list of chunks,\n",
    "effectively creating a linked list from the\n",
    "first chunk to the last.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Collect all the form IDs and form 10k item names\n",
    "distinct_form_id_result = kg.query(\"\"\"\n",
    "MATCH (c:Chunk) RETURN DISTINCT c.formId as formId\n",
    "\"\"\")\n",
    "\n",
    "distinct_form_id_list = list(map(lambda x: x['formId'], distinct_form_id_result))\n",
    "\n",
    "# Connect *all* section chunks into a linked list..\n",
    "cypher = \"\"\"\n",
    "  MATCH (from_same_form_and_section:Chunk) // match all chunks\n",
    "  WHERE from_same_form_and_section.formId = $formIdParam // where the chunks are from the same form\n",
    "    AND from_same_form_and_section.f10kItem = $f10kItemParam // and from the same section\n",
    "  WITH from_same_form_and_section // with those collections of chunks\n",
    "    ORDER BY from_same_form_and_section.chunkSeqId ASC // order the chunks by their sequence ID\n",
    "  WITH collect(from_same_form_and_section) as section_chunk_list // collect the chunks into a list\n",
    "    CALL apoc.nodes.link(section_chunk_list, \"NEXT\", {avoidDuplicates: true}) // then create a linked list in the graph\n",
    "  RETURN size(section_chunk_list)\n",
    "\"\"\"\n",
    "\n",
    "for form_id in distinct_form_id_list:\n",
    "  for form10kItemName in ['item1', 'item1a', 'item7', 'item7a']:\n",
    "    kg.query(cypher, params={'formIdParam':form_id, 'f10kItemParam': form10kItemName})\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Example questions - vector similarity search with Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Try Neo4j vector search helper\n",
    "\n",
    "The `shared.ipynb` notebook has a helper function to perform a vector similarity search\n",
    "using the Neo4j Knowledge Graph.\n",
    "\n",
    "It will perform vector similarity search using the `form_10k_chunks` vector index.\n",
    "\n",
    "Try it out by searching for information about one of the companies in the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "search_results = neo4j_vector_search(\n",
    "    'In a single sentence, tell me about Netapp.'\n",
    ")\n",
    "search_results[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Question Answering chat with Langchain \n",
    "\n",
    "Notice that we only performed vector search. So what we're getting\n",
    "back is the raw chunk text.\n",
    "\n",
    "If we want to create a chatbot that provides actual answers to\n",
    "a question, we can build a RAG system using Langchain.\n",
    "\n",
    "The basic RAG flow goes through these steps:\n",
    "\n",
    "1. accept a question from the user\n",
    "2. perform a database query to find relevant text that may provide an answer\n",
    "3. package the original question plus the relevant text into a prompt\n",
    "4. pass the entire prompt to an LLM to produce an answer\n",
    "5. finally, return the LLM's answer to the user\n",
    "\n",
    "Langchain is a great framework for creating a complete RAG workflow.\n",
    "\n",
    "It has excellent integration with Neo4j. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'The capital of France is Paris.'"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# try the chat api directly\n",
    "result = chat_api.invoke(\"What is the capital of France?\")\n",
    "\n",
    "result.content"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Neo4j Vector Store\n",
    "\n",
    "The easiest way to start using Neo4j with Langchain\n",
    "is with the `Neo4jVector` interface.\n",
    "\n",
    "This makes Neo4j look like a vector store using\n",
    "the vector index you created earlier.\n",
    "\n",
    "Under the hood, it will use the Cypher language\n",
    "for performing vector similarity searches.\n",
    "\n",
    "The configuration specifies a few important things:\n",
    "- use the defined `embeddings_api` for embeddings\n",
    "- how to connect to the Neo4j database\n",
    "- the name of the vector index to use\n",
    "- the label of the nodes to search\n",
    "- the property name of the text on those nodes\n",
    "- and, the property name of the embeddings on those nodes\n",
    "\n",
    "That vector store then gets converted into a retriever\n",
    "and finally added to a Question Answering chain."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a langchain vector store from the existing Neo4j knowledge graph.\n",
    "neo4j_vector_store = Neo4jVector.from_existing_graph(\n",
    "    embedding=embeddings_api,\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    node_label=VECTOR_NODE_LABEL,\n",
    "    text_node_properties=[VECTOR_SOURCE_PROPERTY],\n",
    "    embedding_node_property=VECTOR_EMBEDDING_PROPERTY,\n",
    ")\n",
    "\n",
    "# Create a retriever from the vector store\n",
    "retriever = neo4j_vector_store.as_retriever()\n",
    "\n",
    "# Create a chatbot Question & Answer chain from the retriever\n",
    "chain = RetrievalQAWithSourcesChain.from_chain_type(\n",
    "    chat_api, chain_type=\"stuff\", retriever=retriever\n",
    ")\n",
    "\n",
    "prettyVectorSearch = prettifyChain(chain)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ask some questions\n",
    "\n",
    "Finally, you can use the Langchain chain, which combines the retriever\n",
    "and the vector store into a nice question and answer interface.\n",
    "\n",
    "You can see both the answer and the source that the answer came from."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "prettyVectorSearch(\"What is Netapp's primary business?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "prettyVectorSearch(\"Where is Netapp headquartered?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "prettyVectorSearch(\"Briefly tell me about Netapp in a single sentence.\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
